[
  {
    "Name": "JavaScript Fundamentals",
    "Description": "Everything we teach for the first 14 weeks of your experience here at Lambda School revolves around software engineering for the web. One of the most powerful web languages is JavaScript. Without it, there is no web. All web browsers use JavaScript in some fashion to power rich user experiences for those interacting with a web page or application. \n\nI love to look at JavaScript through this analogy. Think of a web page as a house. You need someone to architect and get in the structure of your house, someone to add in the design, and someone to add in the electricity to power the house. If you were to think about HTML, CSS and JavaScript as the three necessary building blocks, for a web page, HTML could be the architecture/layout of what your house should be, CSS is the design/style of your house and JavaScript powers the electrical interactions that our house needs to have in order to be functional.\n\nJavaScript is everywhere today! And we have the opportunity here to dive deep enough into the language to teach you how to be proficient in building modern, complex and beautiful web applications that are used to power the web today!",
    "Modules": "JavaScript IV,JavaScript III,JavaScript II  ,JavaScript I",
    "Search Test": "",
    "Sprint Challenge": "JavaScript Foundations Sprint Challenge",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "recclZwJxMU8kUngT",
    "Module Count": 4,
    "Average Projected Level": 3.5,
    "Advisory Council Reviews": "Scott Moss,Muhammad Muhsin,Adam Hobson",
    "Advisory Council Reviews 2": "",
    "Created time": "11/14/2017 11:03am",
    "Objectives Count": 11,
    "Sprint Order": 3
  },
  {
    "Name": "Data Structures",
    "Description": "Data Structures are a fundamental building block of Computer Science. Each particular data structure stores and retrieves data in a particular fashion; in other words, each data structure is a like a tool in a toolbox. Every one of them is optimal for some task, and non-optimal for many others. Your job as the programmer is to figure out which data structure(s) are most applicable to the problem at hand and then correctly implement said data structure(s) into that solution. \n\nAny program that goes beyond the traditional `Hello World` application can be thought of as essentially a combination of `Data Structures and Algorithms`. In fact it was Nicklaus Wirth who wrote the book _ Algorithms + Data Structures = Programs_. \n\nIf you have never studied computer science before, then you're in for a treat. The concepts taught here will help you gain a fundamental grasp of the foundation of all computer programs from here on and especially the rich programs we see on the web today. If you _have_ studied CS in the past, then good, you already know how important data structures are. In fact, many seeking CS degrees at 4 year universities spend entire semesters learning about these concepts. Here at Lambda School, you get a week! \n\nWith that being said, while they weren't explicitly talked about during the web curriculum, you guys were indirectly exposed to data structures all the time. A lot of what we talk about here in this module will formalize and then expand upon many of those concepts that were indirectly touched on in the web curriculum. You will be stretched incredibly thin this week. Your brains will receive an overload of information and you will come out of this having at least been exposed to these concepts, and having had some extensive practices with these tasks. They are not trivial, they are very intense so please, be sure to remember that this isn't a race against your peers. Think of it as a race against yourself. Seeing how far you can stretch yourself is the goal here. So don't stress out too much.",
    "Modules": "Data Structures,Data Structures",
    "Search Test": "",
    "Sprint Challenge": "Data Structures Sprint Challenge",
    "Curriculum Sets": "",
    "Record ID": "recPRdzEsVMnIROis",
    "Module Count": 2,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "11/14/2017 11:03am",
    "Objectives Count": 5,
    "Sprint Order": ""
  },
  {
    "Name": "Advanced CSS",
    "Description": "Responsive design pushes our basic CSS styling forward into thousands of devices.  A growing trend in today's markets continue to be mobile devices that range from large tablets to small screens.  You need to be able to correctly deliver content to all of these mediums.\n\nPreprocessors introduce variables, scoping, mixins, and functions into CSS allowing for a more robust programming experience.  Most development shops rely heavily on preprocessors to get large amounts of work done across multiple teams.  Learnings how to use preprocessors will increase overall CSS productivity, reduce errors, and prepare students for the workplace.\n\nPreprocessing is a great introduction to JavaScript concepts like scope, variables, and DRY code paradigms.",
    "Modules": "Preprocessing II,Preprocessing I,Responsive Design II,Responsive Design I",
    "Search Test": "",
    "Sprint Challenge": "Advanced CSS Sprint Challenge",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "recIXiQgpgMdJ81ms",
    "Module Count": 4,
    "Average Projected Level": 1.5,
    "Advisory Council Reviews": "Vijay Swamidass,Adam Hobson",
    "Advisory Council Reviews 2": "Scott Moss,Feifan Zhou,Jana Beck",
    "Created time": "11/14/2017 11:03am",
    "Objectives Count": 10,
    "Sprint Order": 2
  },
  {
    "Name": "Relational Databases",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "Web DB Sprint Challenge",
    "Curriculum Sets": "",
    "Record ID": "rec7KQf5lu3b2vuoY",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "12/6/2017 2:30pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Authentication",
    "Description": "Authentication is one of the largest concepts that we get to tackle in such a short period of time. Have you ever wondered what happens when you \"log in\" to a website? Well this week we get a chance to learn all about that. When a user inputs data into a `username/password` form and clicks login, what then happens to that data? How does the site the user is working with even know that the data it is showing pertains to that specific user? This all has to do with what we call `Authentication`.\n\nThis concept is HUGE. People spend their entire careers hovering around this single ideal. Auth ties in the principles of `Server Sessions` `Password Encryption/Hashing` `Security Risks` `JSON Web Tokens` and the use of different types of `Middlewares` and many other ideas. And what we are able to tackle here in the \"Web\" portion of the Lambda School Computer Science Academy portion will pale in comparison to what you can learn further on your own. And don't worry, we talk more about this when you get to the 2nd half of the course.",
    "Modules": "Client Side Authentication,Using JSON Web Tokens (JWT),Using Sessions and Cookies,Introduction to Authentication",
    "Search Test": "",
    "Sprint Challenge": "Authentication",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "recozTHaHJe6L1ThN",
    "Module Count": 4,
    "Average Projected Level": 2.8,
    "Advisory Council Reviews": "Jana Beck,Steven Miyakawa a.k.a. Sam Samskies,Vijay Swamidass,Moiz Rizvi",
    "Advisory Council Reviews 2": "",
    "Created time": "12/6/2017 2:30pm",
    "Objectives Count": 11,
    "Sprint Order": 13
  },
  {
    "Name": "Building RESTful Web APIs with Express and Node.js",
    "Description": "This week we'll learn how to build web services based on the `REST` (**RE**presentational **S**tate **T**ransfer) architectural style.\n\nWe'll learn about `Node.js`, a runtime environment used to **execute JavaScript code outside the browser** and the popular `Express` framework that makes it really easy to write web applications, and web services, on top of `Node.js`.",
    "Modules": "Deployment and Best Practices,Express Middleware,Server-side Routing,Introduction to Node.js and Express",
    "Search Test": "",
    "Sprint Challenge": "Web API Unit Challenge",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "reckzQd7ZgiFY5ok5",
    "Module Count": 4,
    "Average Projected Level": 3.8,
    "Advisory Council Reviews": "Jana Beck,Steven Miyakawa a.k.a. Sam Samskies",
    "Advisory Council Reviews 2": "Moiz Rizvi,Karan Kurani",
    "Created time": "12/6/2017 2:30pm",
    "Objectives Count": 13,
    "Sprint Order": 11
  },
  {
    "Name": "Introduction to User Interface and Git",
    "Description": "Having the ability to craft user interface is key for full stack web developers in all organizations.  Another key ability for professional developers is knowing how to use git.  We cover both topics throughout the week culminating in a multi-page website sprint challenge.\n\nThe goal of this sprint is to build user interfaces and introduce git into our work flow.  Concepts covered: Semantic HTML, box model, display types, layout techniques, flex box, basic terminal use, basic git use.",
    "Modules": "Git for Web Development,User Interface III,User Interface II,User Interface I",
    "Search Test": "",
    "Sprint Challenge": "User Interface and Responsive Web Sprint Challenge",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "recfwZvI7QhMa7xbG",
    "Module Count": 4,
    "Average Projected Level": 2.5,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "Jana Beck",
    "Created time": "12/6/2017 2:30pm",
    "Objectives Count": 16,
    "Sprint Order": 1
  },
  {
    "Name": "Adding Data Persistence to Web APIs",
    "Description": "This week we'll learn about databases, what they are and how to use them from our Web APIs.\n\nDatabases are ubiquitous in just about everything we do, they power our mobile devices, the sites we visit every day, the applications we use and even some of the appliances in our homes. In short databases are the containers of humanity's digital assets. **Every time you hit a `Save` button data goes into a database!**\n\nThe world of databases is large and complex. There are full careers built around them. Fortunately we'll approach them from the point of view of a developer and leave all other unneeded complexity for the curious to explore.",
    "Modules": "Introduction to Data Modeling,\"Querying Data, Migrations and Seeding\",Inserting and Modifying Data,Introduction to Relational Databases and SQL",
    "Search Test": "",
    "Sprint Challenge": "Web DB Sprint Challenge",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "receFLR7MpwQXesIN",
    "Module Count": 4,
    "Average Projected Level": 2.3,
    "Advisory Council Reviews": "Feifan Zhou",
    "Advisory Council Reviews 2": "",
    "Created time": "12/6/2017 2:30pm",
    "Objectives Count": 14,
    "Sprint Order": 12
  },
  {
    "Name": "React",
    "Description": "React is a UI library that is used in various forms to create complex, rich user interfaces. Facebook had a need to build something that could power their user experiences in such a way that was decoupled and unconcerned when and where the data was received.\n\nReact is one of the most popular UI libraries today, and in terms of Single Page Applications many (including the react team) tend to think of the library as the \"V\" in MVC. That is, the View layer of the Model, View, Controller paradigm. React is a pattern, a mindset, that will help developers that use it, build small, reusable pieces of UI that can be easily put together to make a large scale application.",
    "Modules": "Class Components II,Class Components I,Functional Components II,Functional Components I",
    "Search Test": "",
    "Sprint Challenge": "React Wars",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "recYL2HDPPpkDmGEm",
    "Module Count": 4,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "Jana Beck,Muhammad Muhsin,Karan Kurani",
    "Advisory Council Reviews 2": "Adam Hobson",
    "Created time": "12/6/2017 2:30pm",
    "Objectives Count": 14,
    "Sprint Order": 6
  },
  {
    "Name": "Testing",
    "Description": "This week is all about _automated testing_. Writing tests makes for happy developers and a happy codebase. We will write unit tests and learn techniques to test our React components as well as our back end services.",
    "Modules": "Testing the Back End,Testing React,Unit Testing II,Unit Testing I",
    "Search Test": "",
    "Sprint Challenge": "Testing Sprint Challenge",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "recXv0JwyeYd6y2Jq",
    "Module Count": 4,
    "Average Projected Level": 3.3,
    "Advisory Council Reviews": "Feifan Zhou,Jana Beck,Adam Hobson,Moiz Rizvi",
    "Advisory Council Reviews 2": "Karan Kurani",
    "Created time": "12/6/2017 2:30pm",
    "Objectives Count": 10,
    "Sprint Order": 14
  },
  {
    "Name": "Build Week: Back End",
    "Description": "### Back-end Development Role Description\n\nYou have been learning all about NodeJS and Express and SQL in order to craft Web Servers and build API's for consumption by client-side applications. You will use these skills to be in charge of building out the back-end API for your project.\n\n#### The `Back End Development` unit explored the following topics:\n\n- Building RESTful Web APIs with Express and Node.js\n- Server-side Routing`,`Express Middleware\n- Deployment and Good Practices\n- Introduction to Relational Databases and SQL\n- Inserting and Modifying Data\n- Querying Data, Migrations and Seeding\n- Introduction to Data Modeling\n- Introduction to Authentication\n- Using Sessions and Cookies\n- Using JSON Web Tokens (JWT)\n- Client Side Authentication\n- Introduction to Automated Testing\n- Testing React Applications\n- Testing Web APIs\n\n#### Your primary role as a Back-end Architect\n\nYou will use your skills to be responsible for the back-end architecture of this project. You will work closely with your Front End Architect and your Scrum Master in order to discover project needs and deliver working Endpoints for your application.\n\n#### Grading Rubric:\n\nUse [this rubric](https://docs.google.com/spreadsheets/d/1sFgvt8HtqNCw32YC8Wvrgrdb61oEWPTsBUrvOL3rAGQ/edit#gid=0) to help guide your development processes",
    "Modules": "Delivering a Backend Web Server",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "recWkcWui91eG1s8q",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "Steven Miyakawa a.k.a. Sam Samskies,Moiz Rizvi",
    "Advisory Council Reviews 2": "",
    "Created time": "12/6/2017 2:30pm",
    "Objectives Count": 0,
    "Sprint Order": 15
  },
  {
    "Name": "Redux",
    "Description": "Redux is a state management system. Its uses are better suited for large scale applications, with many developers working across multiple parts of each application. React and Redux are used very commonly together to help piece back together the MVC-esque paradigm.",
    "Modules": "Redux Middleware / Authentication,Async Redux - Redux Thunk,Redux Fundamentals II,Redux Fundamentals I",
    "Search Test": "",
    "Sprint Challenge": "Redux Smurfs",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "recBuB0W7AFWzxtIL",
    "Module Count": 4,
    "Average Projected Level": 3.8,
    "Advisory Council Reviews": "Jana Beck,Muhammad Muhsin,Karan Kurani",
    "Advisory Council Reviews 2": "Scott Moss,Feifan Zhou,Adam Hobson,Moiz Rizvi",
    "Created time": "12/6/2017 2:30pm",
    "Objectives Count": 13,
    "Sprint Order": 9
  },
  {
    "Name": "Computer Architecture",
    "Description": "Until now, the computer itself has been something of a mysterious black box that miraculously executes our instructions for us. This sprint will explore how computers work at a very low level, giving you additional perspective that helps you approach the software development with more confidence.",
    "Modules": "Computer Architecture II,Computer Architecture I",
    "Search Test": 1,
    "Sprint Challenge": "Binary, Decimal, and Hex conversion, and Implementation of Conditional Jumps",
    "Curriculum Sets": "Computer Science",
    "Record ID": "recndTnO1V8oDbBPb",
    "Module Count": 2,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "Jana Beck,Feifan Zhou,Andrew Askins",
    "Created time": "12/7/2017 11:13am",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "Intro to Web Development",
    "Description": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/2ogrsfkqy14\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n\nWelcome to Lambda School’s free Intro to Web Development course. This course runs live regularly Monday through Thursday from 5-8pm PST (1700-2000 UTC -7). \n\nYou can register for the live sessions [here](https://lambdaschool.com/courses/cs/web/bootcamp/), or use the video archives here to follow along asynchronously.\n\nYou'll be able to find everything you need each night from this Sprint overview page. In many technical jobs, a sprint is a unit of time to work on a set of given tasks. This Intro course is one sprint long and contains eight lessons, listed below.\n\n__5PM Pacific__: Live Instruction.\nOpen the [Zoom Webinar](https://zoom.us/j/883625926) to join the discussion. You may ask questions in Slack, or the Zoom webinar chat.\n\n__6PM Pacific__: Project Time.\nComplete the project linked on the appropriate lesson page below. The project will help you practice and internalize what you learned during the live instruction.\n\nIf you need help during project time, you may ask in Slack or in the Zoom chat.\n\n__7PM Pacific__: Standup Meetings.\nSmall group discussion to review the project, ask and answer questions, and get to know other people in your class. The meeting emulates the daily standup meeting we hold every day in the full-time classes, and is one of the many things that make Lambda School special.\n\n__First Night Attendance Form:__\nOn the first night of your class, you will be asked to fill out a form. This is to be filled out on the first night only. This will count as your attendance and allow you to turn in your assignment. The form can be found here: [https://airtable.com/shroINmfxmWFSZA4C](https://airtable.com/shroINmfxmWFSZA4C)\n\n__Daily Standup Form:__\nAt the end of each evening, you will be asked to fill out a \"daily standup form\". This form acts as your attendance, allows you to \"turn in\" your assignment, and enables you to leave valuable feedback for us. You can find this form here: [https://airtable.com/shrvcre7JYF0ofj5O](https://airtable.com/shrvcre7JYF0ofj5O)",
    "Modules": "JS VI: Callbacks,JS V: Classes,JS IV: Data Structures,JS III: Functions,JS II: Control Flow,Introduction to JavaScript,HTML and CSS Fundamentals,Introduction to Web Development Fundamentals",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Precourse FSW",
    "Record ID": "recw0xX1tIMtJAQ3D",
    "Module Count": 8,
    "Average Projected Level": 1.8,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "12/7/2017 11:20am",
    "Objectives Count": 22,
    "Sprint Order": ""
  },
  {
    "Name": "Career Development I",
    "Description": "Covers; personal pitch, resume building, linkedin profiles.",
    "Modules": "Resume/Linkedin profile building",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Development",
    "Record ID": "recik8Jydie2A0lEa",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "12/7/2017 4:25pm",
    "Objectives Count": 3,
    "Sprint Order": ""
  },
  {
    "Name": "Intro to C",
    "Description": "The C programming language is an old one, but it's also so prevalent that C will likely never die. While programming languages have progressed leaps and bounds since C was first written, learning the language is very useful for any aspiring developer, since C abstracts almost nothing away from you, so you're forced to encounter and come to grips with the nitty gritty details of how your machine works under the hood. \n\nEven though at this point in your Lambda journey, you've picked up both JavaScript and Python, the C programming language represents a rather large deviation from the idioms and tools that you've come to expect from other programming languages. But with it, we'll be diving into hitherto uncharted territory such as manipulating raw memory, performing our own garbage collection, and making system calls to the operating system. Exciting stuff!",
    "Modules": "Processes and System Calls,Introduction To C",
    "Search Test": "",
    "Sprint Challenge": "Write a Unix Program to Display a Directory Listing",
    "Curriculum Sets": "Computer Science",
    "Record ID": "recQ277OLX2zZXPKd",
    "Module Count": 2,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "Feifan Zhou",
    "Advisory Council Reviews 2": "Jana Beck",
    "Created time": "12/14/2017 10:22pm",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "Intermediate React",
    "Description": "Some of the best patterns in react revolve around the concept that the library is unopinionated in the way your application can be structured. This week we're going to be diving into some of the more advanced react compositional patterns that you'll find in many react applications. We will be working on a single project throughout the whole week as we learn new ways to approach different challenges of building the User Interface for an Instagram Clone. This will set you up to be challenged to re-implement your Lambda Times assignment from the Applied JavaScript week.",
    "Modules": "CSS in JS,React Composition Patterns,The React Lifecycle,React Tooling",
    "Search Test": "",
    "Sprint Challenge": "Lambda Times, React",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "recm0bFI7wQ1aVVe4",
    "Module Count": 4,
    "Average Projected Level": 3.8,
    "Advisory Council Reviews": "Feifan Zhou,Jana Beck,Muhammad Muhsin,Karan Kurani",
    "Advisory Council Reviews 2": "Scott Moss,Feifan Zhou,Adam Hobson",
    "Created time": "12/22/2017 4:19pm",
    "Objectives Count": 9,
    "Sprint Order": 7
  },
  {
    "Name": "Graphs",
    "Description": "A graph is a great general-purpose data structure that can be used to solve a wide variety of computing problems. It is the general case of the trees with which you are already familiar, where edges can connect one vertex to any other, not just downward. We will explore how to implement graphs, and several of the algorithms surrounding graphs to how they can be applied to solving real-world problems.\n\nNote that the project for this topic is built over four days.  See the [README](https://github.com/LambdaSchool/Graphs/blob/master/projects/graph/README.md) for the project details.",
    "Modules": "Graphs II,Graphs I",
    "Search Test": "",
    "Sprint Challenge": "Maze Traversal",
    "Curriculum Sets": "Computer Science,DS - Computer Science",
    "Record ID": "rec7U9K7OCL5ihj0t",
    "Module Count": 2,
    "Average Projected Level": 2.5,
    "Advisory Council Reviews": "Adam Hobson",
    "Advisory Council Reviews 2": "Feifan Zhou,Vijay Swamidass",
    "Created time": "1/4/2018 1:27pm",
    "Objectives Count": 5,
    "Sprint Order": 4
  },
  {
    "Name": "Build Week: Front End",
    "Description": "It's time to put all your fundamentals to the test.  Being able to combine the knowledge of building Static Websites with your newly found knowledge of ReactJS and its corresponding packages and libraries is what this unit is all about.\n\n#### Web Application Development Role Description\n\nReact JS has been your focus over the last 4 weeks. You will use those skills learned during the React Unit to build out a web application that consumes a CRUD API.\n\n#### The `Web Application Development` unit explored the following topics:**\n\n- Functional Components 1 - 2\n- Class Components 1-2\n- React Tooling\n- The React Life-cycle\n- React Composition Patterns\n- CSS in JS\n- React Router 1 - 2\n- HTTP/AJAX 1 - 2\n- Redux Fundamentals 1 - 2\n- Async Redux w/ Redux Thunk\n\nFor your project this week, you will demonstrate proficiency by working with a group of students cross-section to deliver a minimum viable product (MVP) over the course of the week.\n\n## Your primary role as the Web Application Architect:\n\nYou will use your skills to be responsible for the Front End Architecture of this project. You will work directly with the UI Developer and the Back End Developer to ensure that all React components are wired up in proper fashion.\n\n#### Grading Rubric Link:\n\nUse [this rubric](https://docs.google.com/spreadsheets/d/1dL5UfyiHJ2qxWWfot-FTOeU3KUvZaixAKvkJ0uLuhL8/edit?usp=sharing) to help guide your development processes",
    "Modules": "Delivering a Single Page Application",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "recVFiuMBzbcZllxC",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "Steven Miyakawa a.k.a. Sam Samskies,Vijay Swamidass,Adam Hobson,Moiz Rizvi",
    "Advisory Council Reviews 2": "",
    "Created time": "1/29/2018 1:33pm",
    "Objectives Count": 2,
    "Sprint Order": 10
  },
  {
    "Name": "Build Week: Android",
    "Description": "It's time to put all your fundamentals to the test. You have learned all about the foundations of Android development over the past four weeks. You will build an Android client for your teams project.\n\n**The `Android Core` Unit explored the following topics:**\n- Intents\n- Activity Lifecycle\n- Git for Android Development\n- Android Model View Controller\n- Shared Preferences\n- Showing Lists\n- Drawables, Themes, and Resource Files\n- Notifications\n- Threading\n- HTTP Requests\n- Broadcasts and Services\n- Fragments\n- Animated Images\n- Layout Animations\n- Custom Views\n\nFor your project this week, you will demonstrate proficiency by working with a group of students cross section to deliver a minimum viable product (MVP) over the course of the week.\n\n**Your primary role as an Android Developer:**\n\nYou will build an Android app that uses the backend API developed by the full stack web students in your group. Your Android app should have a design that closely correlates with the theme used on the web front end. Your app should be built using the Model View Controller architecture, and should demonstrate your proficiency in the skills you've learned so far.\n\n## Grading Rubric:\n\nUse [this rubric](https://docs.google.com/spreadsheets/d/1Wfxz5uwb0A77nxSuGlci_s4p8eJvsaybeFTt4-JS7V8/edit?usp=sharing) to guide your development processes.",
    "Modules": "Delivering an Android Application",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Android Development Core",
    "Record ID": "rec1rdWLm0i4ZZVcw",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/12/2019 11:13am",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Career Development II",
    "Description": "Covers; Job search techniques, Informational Interviews, Networking",
    "Modules": "Job Search Pro Tips/Networking",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Development",
    "Record ID": "rech7g4cZNrvEr5KW",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "Jana Beck",
    "Advisory Council Reviews 2": "",
    "Created time": "1/29/2018 1:39pm",
    "Objectives Count": 4,
    "Sprint Order": ""
  },
  {
    "Name": "Career Development III",
    "Description": "Covers; Nailing the Interview and Offer negotiations",
    "Modules": "Nailing the Interview/Offer Negotiations",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Development",
    "Record ID": "recq8e4kAHFyR28ju",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/6/2018 11:08am",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "Career Development IV",
    "Description": "Prepare students for their new full-time task: looking for and landing a job. Covers resume/Linkedin building, Job search techniques, interview prep/process, and negotiating an offer.",
    "Modules": "Negotiating an Offer",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recXLXTJ1rrcnV57b",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/7/2018 3:58pm",
    "Objectives Count": 3,
    "Sprint Order": ""
  },
  {
    "Name": "Python/Django III/Career Development",
    "Description": "A lot of the power of a web application framework is how it connects to an underlying database - this connection can be abstracted using an object-relational mapping, and Django has a powerful approach to this. We will learn how to use it, and also more about the (typically relational) databases that underlie it.",
    "Modules": "Relational Databases,Object-relational mapping",
    "Search Test": "",
    "Sprint Challenge": "Django App Assessment",
    "Curriculum Sets": "Computer Science Annex",
    "Record ID": "reczMSFEG5pffpADx",
    "Module Count": 2,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/13/2018 12:57pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Python/Django I",
    "Description": "In software development you'll run into many different languages and ecosystems. Python is a popular language for general purpose computing, excelling in particular with data but with a huge community and packages for just about everything. Django is a \"batteries-included\" web application framework in Python, used by websites such as Instagram, Disqus, and Bitbucket.\n\nIn this sprint we will get set up with these tools, and then learn about object-oriented programming, which is an important paradigm for modeling and building real-world software. Lastly we'll study software design patterns, which offer generalized solution techniques to common development problems.",
    "Modules": "Software Design Patterns,Object-Oriented Programming,Getting started with Python and Django",
    "Search Test": "",
    "Sprint Challenge": "Deploy Django App to Heroku",
    "Curriculum Sets": "Computer Science Annex",
    "Record ID": "recUHGX7arXkBIutr",
    "Module Count": 3,
    "Average Projected Level": 1.7,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "Jana Beck",
    "Created time": "2/13/2018 12:57pm",
    "Objectives Count": 5,
    "Sprint Order": ""
  },
  {
    "Name": "Python/Django II/Career Development",
    "Description": "The heart of many web applications is the API it exposes - in this week we will learn about two paradigms for API design (REST and GraphQL), and how the Model-view-controller design pattern builds on these to result in a full application.",
    "Modules": "Model-View-Controller,GraphQL,REST",
    "Search Test": "",
    "Sprint Challenge": "Django ORM Sprint Challenge",
    "Curriculum Sets": "Computer Science Annex",
    "Record ID": "rec64nbdwB28JM7Qu",
    "Module Count": 3,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/13/2018 12:57pm",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Applied JavaScript",
    "Description": "This week is all about exposing you to applying your Javascript knowledge to the Document Object Model and creating rich Javascript user interfaces.",
    "Modules": "Components II,Components I,DOM II,DOM I",
    "Search Test": "",
    "Sprint Challenge": "Applied JavaScript Challenge",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "recPSZMPrmESUYo2C",
    "Module Count": 4,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "Adam Hobson,Moiz Rizvi",
    "Advisory Council Reviews 2": "",
    "Created time": "2/22/2018 3:59pm",
    "Objectives Count": 12,
    "Sprint Order": 4
  },
  {
    "Name": "Mathematical Foundations",
    "Description": "# Welcome to Lambda School!\n\n<img src=\"https://files.slack.com/files-pri/T4JUEB3ME-F9PKVV8UX/lambda_logo_full.png\" text=\"Lambda School Logo\">\n\n\n\n<p>\nMachine Learning creates algorithms that can discover the shape of large datasets, datasets that are much larger than a human could ever compute in their lifetimes. Before we can teach computers to discover his dataset shape, we need to study the shape of smaller datasets. Learn about the most basic function, `y = f(x)` and how it informs our understanding of the shape of any dataset. We will study how to optimize `y = f(x)`, that is, identify where it is largest or smallest, and from a given sample we can compute the gradient that leads us to the optimum.\n</p>\n\n<img src=\"https://www.dropbox.com/s/r0hmp2ei215ma6f/Screenshot%202018-03-20%2017.34.47.png?raw=1\" text=\"Some random points\">\n\n<p>\nAll Machine Learning depends on the relationships of data in a high dimensional space. Linear algegbra is primarily the tool used for transforming, visualizing, and understanding high dimensional spaces.\n</p>\n\n<img src=\"https://www.dropbox.com/s/u5nh4xk923imxlk/Screenshot%202018-03-20%2017.25.24.png?raw=1\" text=\"sin(x) and the derivative of sin(x) at x = 0.88\">",
    "Modules": "Linear Algebra,Functions and Optima",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recJr62c4PXTGDxRY",
    "Module Count": 2,
    "Average Projected Level": 2.5,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 11:14am",
    "Objectives Count": 10,
    "Sprint Order": ""
  },
  {
    "Name": "Reinforcement Learning",
    "Description": "The most traditional form of \"machine learning\", reinforcement learning attempts to improve the result of an evaluation function on an input. For each input, there is a best output. By reinforcing the best output over a large number of iterations, the model can be trained.\n\nWhen GPS isn't available, computer visual systems need to create and maintain a map of their own environment. Learn how to build and maintain that representation for robotic navigation.",
    "Modules": "Simultaneous Location and Mapping (SLAM),Reinforcement Learning,Computer Vision for Self Driving Cars",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "rec7K0lB7cSU6duNl",
    "Module Count": 3,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "Mathew Calkins",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 12,
    "Sprint Order": ""
  },
  {
    "Name": "Capstone Week",
    "Description": "",
    "Modules": "Capstone Week 3",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "rec4hPrWfoX2DzprF",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Artificial Intelligence",
    "Description": "Evolutionary algorithms calculate results using machine learning models that have been inspired by the study of existing phenomena in nature.\n\nSupport vector machines enable identifying inputs from two different classes with a very high degree of accuracy. They can separate the two classes in complicated and unintuitive ways - the most powerful form of regression currently available.",
    "Modules": "Support Vector Machines,Evolutionary Algorithms",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "rec3W6n9EzxF9ga7y",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "Mathew Calkins",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 5,
    "Sprint Order": ""
  },
  {
    "Name": "Cloud AI",
    "Description": "TensorFlow is an online library toolkit for building great ML toolkits. We can use TensorFlow to build some of the most powerful ML algorithms without having to reimplement them ourselves.\n\nGoogle is making available huge parallel ML hardwares to the public. Accessible from the internet, a TPU gives you more computational power than any researcher who has come before you.\n\nAmazon also provides AI services. Lets make sure that we can use them to build fast and inexpensive algorithms for customers.",
    "Modules": "TensorFlow,Google TPUs,Amazon AI",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recZrSypOoKUVcKVd",
    "Module Count": 3,
    "Average Projected Level": 0.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 4,
    "Sprint Order": ""
  },
  {
    "Name": "Capstone Week",
    "Description": "## Capstone Weeks\n\nRemember that your ML success depends on your presentation. Lets get back to building your portfolios!\n\nProjects can be individual or as a team.",
    "Modules": "Capstone Week 1",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recxgkGr1SztPaITN",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "CUDA, OpenCL, and Shaders",
    "Description": "Real ML training speed comes from GPU programming. This week we will study the GPU and how to get faster results using ones in the cloud.",
    "Modules": "Deep Learning,Shader Programming",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recvX2ELG1Yj4jtBG",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 7,
    "Sprint Order": ""
  },
  {
    "Name": "High Dimensionality",
    "Description": "This week we concentrate on dimensions. Low dimensions, high dimensions - every sample, every piece of data that can be recorded, is simply a point in some coordinate space. The number of values that make up a particular sample is the number of dimension in the space that sample occupies.",
    "Modules": "Dimensionality Reduction,High Dimensionality",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recrEDgbxjv9tQIP0",
    "Module Count": 2,
    "Average Projected Level": 1.5,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 8,
    "Sprint Order": ""
  },
  {
    "Name": "Computer Architecture",
    "Description": "## Beginning of Computer Science Education\n\nAll Machine Learning depends on the fundamentals of computer operation.\n\nThis week we'll study how your computer works, why it works that way, and how it affects your ML algorithms.\n\nIn particular we'll examine the differences between running ML on your machine, on remote hosts like Google Colab, and how those methods can be productized.",
    "Modules": "Containers,Monoservices and microservices",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recq21e8B4D0P0e5t",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 4,
    "Sprint Order": ""
  },
  {
    "Name": "Probability and Statistics",
    "Description": "Bayes Theorem provides the most well loved (and intuitive) method for computing the probability of any event, actor, or distribution. It is the method that is used, often in combination with Gaussian distributions, for almost all probabilistic analysis.\n\n<img src=\"https://www.dropbox.com/s/b9l3mluu3ro3vqs/Screenshot%202018-03-21%2011.09.18.png?raw=1\" text=\"A gaussian distribution with sigma = 0.5 and mu = 0.0\">",
    "Modules": "An Overview of Regression Analysis,Goodness of fit,Probability Demystified,Statistics Foundations",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recmZV49el0pJSxJX",
    "Module Count": 4,
    "Average Projected Level": 0.8,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 7,
    "Sprint Order": ""
  },
  {
    "Name": "Big Data Tools",
    "Description": "Map/reduce makes search and computation on super-large datasets possible. Your personal computer is maybe 10% as fast as the fastest machines that can presently be built. Google is only possible by connecting thousands of slow computers and mapping their data with map/reduce.\n\nSparc/Hadoop are two of the large hardware parallelization libraries that make indexing and storing data from thousands and thousands of origin sources.\\",
    "Modules": "Map/reduce,Spark/Hadoop/Hive",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recmWNhkmAGzmUox3",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 4,
    "Sprint Order": ""
  },
  {
    "Name": "The Machine Learning Framework",
    "Description": "Classical Machine Learning is performed over datasets using a training set to configure the algorithms and a testing set to measure the model effectiveness. When the results of the test set are maximized, we assume that the model will be good on real data. This is not always the case. Careful configuration of the training and testing sets improve results. In supervised learning, we always know the right answer for the entire training and testing data set, and the goal is for our model to tell us the right answer for data that is outside of our original starting information.\n\nClustering, in contrast to supervised learning, never contains correct result annotations. Instead, clustering algorithms provide greater insight into a dataset, which the ML expert must create explanations for by examining the data.",
    "Modules": "Supervised Learning,Model Tuning",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "reckGwqDe8LDEDWum",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 14,
    "Sprint Order": ""
  },
  {
    "Name": "Unsupervised Learning",
    "Description": "Unsupervised learning is one of the foundations of Data Science. Unsupervised learning performs computations on unlabelled data. Instead of training a model to make predictions based on the previous observations of humans (with labels), unsupervised learning models are asked to create all-new intuitions without human oversight.\n\nThese observations are usually created in the context of \"clustering\" algorithms. A clustering algorithm identifies groups within an unlabelled dataset, at which point the machine learning engineer examines the clusters and creates explanations.",
    "Modules": "Clustering,Association",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recinUYOf5W5Kk5cw",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 5,
    "Sprint Order": ""
  },
  {
    "Name": "Presenting",
    "Description": "No data scientist builds a career without clear and concise communication. Gaining deep intuitive understanding of data is important. Gaining mastery over the models that can predict outcomes from the data is important. Communicating those results to your principal investigators is the most important.\n\n<img src=\"https://www.dropbox.com/s/9ofszdvrhx49bzl/Screenshot%202018-03-20%2021.04.17.png?raw=1\" text=\"A beautiful 3d topology\">",
    "Modules": "Building an ML Portfolio,Presenting for the public: LaTeX and D3",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "rechiHWa1kgoT7uCQ",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 9,
    "Sprint Order": ""
  },
  {
    "Name": "Major Neural Network Architectures",
    "Description": "Deep learning is a fancy word for \"complicated neural network\". Recent advances in neural nets have produced interesting results such as much better image classification results, and spoken language comprehension.\n\n<img src=\"https://www.dropbox.com/s/ruaxvqppmajatfs/Screenshot%202018-03-21%2013.02.30.png?raw=1\" text=\"Silouette of a man pointing at a brain image\">\n\n\nThese networks use groups of highly connected networks, separated by bottlenecks with much smaller sets of connections.\n\nIn order to produce results in a reasonable amount of time using a very-complicated neural network, deep learning algorithms are almost exclusively trained on GPUs.\n\nDeep convolutional neural networks are how Google can now identify you, your family members, your dog, and your favorite restaurants from photos you take through the day. By the time you are finished with Lambda School Machine Learning Academy you will be able to reproduce Hinton's important research that got everyone interested in neural networks again.",
    "Modules": "Deep CNNs,Computer Vision",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recfAMAsnSsPjmBOF",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 9,
    "Sprint Order": ""
  },
  {
    "Name": "C Programming: Get 'er done faster",
    "Description": "The C programming language affords most of the computational speed you get from TensorFlow and other ML APIs. Lets make sure you can write simple C programs to speed up your python.",
    "Modules": "Make C do linear algebra,Call C from python",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recbMhahJc5OnIhMu",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 4,
    "Sprint Order": ""
  },
  {
    "Name": "Neural networks",
    "Description": "The backbone of the modern excitement in Machine Learning, recent advancements in high performance computing have made neural nets interesting again. The basic design is based on neuroscience of the 1960s, but neural nets weren't capable of much except for handwriting recognition for a long time.\n\n<img src=\"https://www.dropbox.com/s/al7ofgi2jizmqbf/Screenshot%202018-03-21%2013.01.07.png?raw=1\" text=\"Artful rendering of some neurons\">",
    "Modules": "Backpropagation",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recYPr8LCK7C1hVzO",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Marketing Week",
    "Description": "",
    "Modules": "Product for Hire",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recWVCFzjlIZRqOQa",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Portfolio Projects",
    "Description": "_Portfolio Project Week 2: Build model solutions_",
    "Modules": "Project Building Alexa,Project Email Content Clustering",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recWjCQQFdKmYp5nm",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "Portfolio Projects",
    "Description": "This week we will get started on fleshing out your portfolios. There are many really cool portfolio ideas to choose from. We'll spend the next three weeks discussing them. I'll suggest methods to implement and present them, how to get them on your web site, and what projects make you look like a great Machine Learning Expert!\n\n_Portfolio Projects Week 1: Choose a project_",
    "Modules": "Project Kaggle Contest,Project Predicting Real Estate Market,Project CNN Reproduce Hinton's Benchmark",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recVKHfCoxv1Z9URs",
    "Module Count": 3,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 10,
    "Sprint Order": ""
  },
  {
    "Name": "Algorithms and Theory",
    "Description": "Artificial Intelligence itself is the process of writing \"best guess\" solutions to problems for which the perfect answer can never be computed (it would take too long). Those best guesses, and knowing when \"best guess\" is as good as you're going to get, depend on understanding CS algorithms.",
    "Modules": "CS Algorithms",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recTEuIE5xHWFOcgS",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 4,
    "Sprint Order": ""
  },
  {
    "Name": "Capstone Week",
    "Description": "",
    "Modules": "Capstone Week 2",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recSRRmf9KFqgssyf",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "Mathew Calkins",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Operating Systems and Parallelization",
    "Description": "ML algorithms depend on an operating system to execute. This week we'll study the three fundamental talents of all operating systems.\n\nIn order to make your models fast you need to be prepared to parallelize their computations. Operating systems aren't smart enough to do this for you, yet.",
    "Modules": "Parallelization,Operating Systems",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recNsit7uq4ufdxDu",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "Data and Visualization",
    "Description": "Data is almost always a spreadsheet. We need methods to get data into spreadsheets, annotate it, and convert it into forms that are efficiently computable by Machine Learning programming languages. We need to identify and trim outliers that break our algorithms, understand the shape and structure of the data, and understand the nature of complexity in the context of large datasets.\n\n![Points in 3D](https://www.dropbox.com/s/mviok6kdqhod47h/Screenshot%202018-03-20%2018.09.44.png?raw=1)\n\nIt is difficult to write a good machine learning model when you can't visualize the data that it represents. More importantly, presenting and pitching what you've learned about your data, from your ML model, keeps you in a job. Drawing cool pictures of incomprehensible datasets is one of the best parts of our job.",
    "Modules": "Data Visualization,Data Preparation: An Overview",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recEcbcIunAX7WT3K",
    "Module Count": 2,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 8,
    "Sprint Order": ""
  },
  {
    "Name": "Natural Language Processing",
    "Description": "Natural Language Processing (NLP) helps Alexa understand what you are asking for. It is also huge in automatic document tagging and identification, a feature that is useful for libraries, legal, and law enforcement.\n\n\nClassical texts include:\nhttps://nlp.stanford.edu/fsnlp/?lipi=urn%3Ali%3Apage%3Ad_flagship3_messaging%3B4SlkMkv%2BQ3%2BgXH%2FNBoxe%2Bw%3D%3D\nand\nhttps://web.stanford.edu/~jurafsky/slp3/?lipi=urn%3Ali%3Apage%3Ad_flagship3_messaging%3B4SlkMkv%2BQ3%2BgXH%2FNBoxe%2Bw%3D%3D",
    "Modules": "Accessing built-in corpuses and building custom corpuses,Sentiment Analysis,Comparing documents or words,Diagnosing the structure of text,Natural Language Processing - Introduction",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recELerz9zEmekMIa",
    "Module Count": 5,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "Mathew Calkins",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:03pm",
    "Objectives Count": 19,
    "Sprint Order": ""
  },
  {
    "Name": "Portfolio Projects 1",
    "Description": "This week we will get started on fleshing out your portfolios. There are many really cool portfolio ideas to choose from. We'll spend the next three weeks discussing them. I'll suggest methods to implement and present them, how to get them on your web site, and what projects make you look like a great Machine Learning Expert!\n\n_Portfolio Projects Week 1: Choose a project_",
    "Modules": "Project CNN Reproduce Hinton's Benchmark,Project Predicting Real Estate Market,Project Kaggle Contest",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recfycpvzCGOXLz7M",
    "Module Count": 3,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:47pm",
    "Objectives Count": 10,
    "Sprint Order": ""
  },
  {
    "Name": "Portfolio Projects 2",
    "Description": "_Portfolio Project Week 2: Build model solutions_",
    "Modules": "Project Email Content Clustering,Project Building Alexa",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "reclaMdCm4sEVwTqS",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:47pm",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "Portfolio Projects 3",
    "Description": "_Portfolio Project Week 3: Make a presentation of your results!_",
    "Modules": "Project NN Recognizing Handwritten Digits,Project Copy Deep Dream Generator",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "rec2qku05tBM5uzWJ",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/23/2018 12:47pm",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "Algorithms",
    "Description": "In this sprint, students will be introduced to how to formally think about and solve algorithmic problems as part of the Algorithms module. Some classic algorithmic paradigms will also be introduced. \n\nJust as importantly, students will also learn how to analyze the complexity of algorithms. Students will practice classifying algorithms using Big O notation, and learn how to compare different algorithms against each other using these runtime classifications.",
    "Modules": "How to Write and Analyze,Sorting",
    "Search Test": "",
    "Sprint Challenge": "Algorithms",
    "Curriculum Sets": "Computer Science,DS - Computer Science",
    "Record ID": "recd9grrKlURJ453N",
    "Module Count": 2,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "Jonathan Bennett,Adam Hobson,Vijay Swamidass",
    "Advisory Council Reviews 2": "",
    "Created time": "4/30/2018 4:29pm",
    "Objectives Count": 5,
    "Sprint Order": 3
  },
  {
    "Name": "Modeling",
    "Description": "Modeling is the primary objective of Machine Learning algorithms. A model is some mathematical construct that, after being configured by an input data set, can make predictions about future inputs.\n\nThe simplest Machine Learning model is Regression.",
    "Modules": "Classification,Ordinary Least Squares Regression",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Machine Learning Core",
    "Record ID": "recur9dwLvQg3SUmp",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/4/2018 2:53pm",
    "Objectives Count": 10,
    "Sprint Order": ""
  },
  {
    "Name": "Single Page Applications",
    "Description": "This week we'll be learning about using two very useful packages with React: Axios and React Router. With the UI Library (React), the promise based HTTP request library (Axios), and the Client Side Routing Library (React Router), you'll be able to craft rich, robust and highly scale-able Single Page Applications. \n\nThe approach here is to expose you to this concept of a Single Page Application that doesn't concern itself with the data that it will presenting to the user. This is how modern applications are built today, where the client (React App) and server are separated out into their own concepts.",
    "Modules": "HTTP / AJAX II,HTTP / AJAX I ,React Router II,React Router I",
    "Search Test": "",
    "Sprint Challenge": "React (SPA) Smurfs",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "recRT8JKvbTiGaosk",
    "Module Count": 4,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "Zack Argyle,Jana Beck",
    "Advisory Council Reviews 2": "",
    "Created time": "5/18/2018 10:49am",
    "Objectives Count": 16,
    "Sprint Order": 8
  },
  {
    "Name": "Lambda Labs",
    "Description": "Lambda Labs is our immersive capstone experience. Students will be split in to small teams and assigned a project to work on and a PM to work with.  This experience will look and feel like a job at a real world dev shop and you will finish it having learned many of the lessons that most people don't experience until their first few weeks on the job.  \n\nStudents will start each day with a stand up meeting, led by their PM, following [this format.](https://www.notion.so/lambdaschool/Labs-Team-Standup-Process-322e0573cba14caf86ff372dddaa8b96)\n\nAt the conclusion of your hard work, your project will be reviewed by an independent third party using this [rubric.]( https://docs.google.com/spreadsheets/d/1r3kOKVvkILBalLkNLTJFQ-gXf2FoPoaWooLcw2nifUk/edit#gid=0)",
    "Modules": "Workplace Objectives",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Lambda Labs",
    "Record ID": "recUmTvKqRFGMX228",
    "Module Count": 1,
    "Average Projected Level": 3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "10/24/2018 12:43pm",
    "Objectives Count": 4,
    "Sprint Order": ""
  },
  {
    "Name": "Labs I - Project Planning",
    "Description": "During this sprint, students will complete a pre-production exercise then build and deploy the skeleton of their capstone project, including user account models and a minimal front and back end.\n\n[The Team Rubric for this week can be found here.](https://www.notion.so/lambdaschool/Labs-I-Team-Rubric-and-Evaluation-Notes-3d6d1d5d33d1404591e575cbe5a082e1)",
    "Modules": "Categorization, Severity, Frequency and Edge Cases\",Test Cases and Test Data,Reviewing Code During Pull Requests,Project Milestones - Start Up",
    "Search Test": "",
    "Sprint Challenge": "Labs I - Startup",
    "Curriculum Sets": "Lambda Labs",
    "Record ID": "recUHb6DrRIIYiDwr",
    "Module Count": 4,
    "Average Projected Level": 1.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/18/2018 10:51am",
    "Objectives Count": 8,
    "Sprint Order": ""
  },
  {
    "Name": "Labs II - Working with Other Developers",
    "Description": "There are a handful of things you’ll learn during your Labs experience in a way unique to any other portion of Lambda School. Learning how to architect a project, and describe why you’ve chosen the technological stack you have chosen is one of them. We did that last week. You’ll also learn how to break down work and plan out a sprint. We’ll continue to get better and better at that with each sprint. You’ll also learn how to scope your work; you’ll get a good feel for what you can and can’t accomplish in a week of work. Again, we’ll get better at that over the course of Labs. Every week you have the chance to practice presenting on a technical topic - another key Labs experience to get your ready for interviews.\n\nOne core learning in Labs is working with other developers. This is something you don’t spend a lot of time on in your first few months. During Labs, you work with a team. \n\n[The Team Rubric for this week can be found here.](https://www.notion.so/lambdaschool/Labs-II-Team-Rubric-and-Evaluation-Notes-7f1329779a704fc597249ddcf9e3a051)",
    "Modules": "Working Through Conflict,Everyone Should Feel Valued,Project Milestones - Integration",
    "Search Test": "",
    "Sprint Challenge": "Labs II - Integration",
    "Curriculum Sets": "Lambda Labs",
    "Record ID": "recs22te7oY64llAl",
    "Module Count": 3,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "10/24/2018 12:43pm",
    "Objectives Count": 9,
    "Sprint Order": ""
  },
  {
    "Name": "Labs III - Understanding Scope",
    "Description": "There are a handful of things you’ll learn during your Labs experience in a way unique to any other portion of Lambda School. Learning how to architect a project, and describe why you’ve chosen the technological stack you have chosen is one of them. We did that last week. You’ll also learn how to break down work and plan out a sprint. We’ll continue to get better and better at that with each sprint. You’ll also learn how to scope your work; you’ll get a good feel for what you can and can’t accomplish in a week of work. Again, we’ll get better at that over the course of Labs. Every week you have the chance to practice presenting on a technical topic - another key Labs experience to get your ready for interviews.\n\n- Architect a project\n- Planning out work for a sprint\n- Scoping work\n- Presenting technical topics\n\n[The Team Rubric for this week can be found here.](https://www.notion.so/lambdaschool/Labs-III-Team-Rubric-and-Evaluation-Notes-1a8cbe4060ff48db83c69e812fa0deec)",
    "Modules": "Planning out Work for a Sprint,Scoping Work,Project Milestones - Feature Complete",
    "Search Test": "",
    "Sprint Challenge": "Labs III - Feature Complete",
    "Curriculum Sets": "Lambda Labs",
    "Record ID": "rec33mGVnhCZFVYWa",
    "Module Count": 3,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/18/2018 10:52am",
    "Objectives Count": 5,
    "Sprint Order": ""
  },
  {
    "Name": "Labs IV - User Testing and UX Planning",
    "Description": "During this sprint, students will finalize the functionality of their application and implement a presentation that follows accepted UI/UX conventions.\n\nThe application should look and feel in a manner that will inspire confidence in users and inspire the same trust that they give to the products they currently use.  \n\n[The Team Rubric for this week can be found here.](https://www.notion.so/lambdaschool/Labs-IV-Team-Rubric-and-Evaluation-Notes-b856ddefbbc5435ca46e82716df88ebb)",
    "Modules": "Project Milestones - Presentation",
    "Search Test": "",
    "Sprint Challenge": "Labs IV - Presentation",
    "Curriculum Sets": "Lambda Labs",
    "Record ID": "rechzyZDlGMxI9ApR",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/25/2018 3:23pm",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "Labs V - Final Polish",
    "Description": "During this sprint, students add final polish to their app and prepare for a public demo.\n\nThey also prepare a video highlighting the features they have built and the technical solutions they used to build them.\n\n[The Team Rubric for this week can be found here.](https://www.notion.so/lambdaschool/Labs-V-Team-Rubric-and-Evaluation-Notes-8619ce42aae74764844b04b0a16f8479)",
    "Modules": "Project Milestones - Polish",
    "Search Test": "",
    "Sprint Challenge": "Labs V - Polish",
    "Curriculum Sets": "Lambda Labs",
    "Record ID": "rec0dFYFDBfPWZclR",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/18/2018 10:52am",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Labs VI",
    "Description": "Note:  This sprint only applies to students who start Labs _before_ CS.\n\nDuring this sprint, students will respond to a change order that requires material change in their application.",
    "Modules": "Change Order",
    "Search Test": "",
    "Sprint Challenge": "Labs VI - Change Order",
    "Curriculum Sets": "",
    "Record ID": "recf038OEc5Eh5hHw",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/18/2018 10:52am",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "Build Week: User Interface",
    "Description": "It's time to put all your fundamentals to the test.  Being able to combine HTML, CSS, JavaScript, Libraries, and Programming Paradigms into a project is a rare skill indeed.\n\n#### The `Web Foundations` Unit explored the following topics:\n\n- User Interfaces 1 - 3\n- Git for Web Development\n- Responsive Design 1 - 2\n- Pre-Processors 1 - 2\n- JavaScript Fundamentals 1 - 4\n- DOM 1 - 2\n- Components 1 - 2\n\nFor your project this week, you will demonstrate proficiency by working with a group of students cross-section to deliver a minimum viable product (MVP) over the course of the week.\n\n#### Your primary role User Interface Developer:\n\n- You will build a multi-page marketing website that matches the theme chosen by your group and provides the user with details about the product your team has selected to build.\n- Your marketing website must include responsive mobile and desktop screen widths. Please see the \"Responsiveness\" portion of your rubric for more information on this.\n- The call to action on the website should be a login button that links the user over to the React application that your Front End Architect is building.\n- Your marketing website must be hosted on a hosting platform like \"Netlify\" or \"Github Pages\".\n- For this Marketing site's home page you need to have content and copy that relates to the product that your team is working on.\n- Descriptions about the product and about the features it provides would be key.\n- For a second page, you could do an about us section that includes images of the members of your team, and links to one another's socials/Github.\n\n#### Your Grading Rubric Here:\n\nPlease review this rubric and fully demonstrate an understanding of your product role by submitting a message to your Project Manager with questions you have. \n\n[Rubric](https://docs.google.com/spreadsheets/d/1BbdmSMUdzURMo0wcsr4XSKvegDgB28WkK2wnjmORzDo/edit?usp=sharing)",
    "Modules": "Delivering a multi-page marketing website.",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Full Stack Web Development Core",
    "Record ID": "rec2di8phTBw15e4E",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "Adam Hobson",
    "Advisory Council Reviews 2": "",
    "Created time": "6/1/2018 10:58am",
    "Objectives Count": 0,
    "Sprint Order": 5
  },
  {
    "Name": "Intro to iOS",
    "Description": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/2ogrsfkqy14\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n\nThis course will teach you iOS basics including Swift fundamentals, using Xcode, Playgrounds, and UIKit basics. This course covers everything you need to know to pass Lambda's iOS admissions challenge. By the end of this course you should be able to build an iOS app with a table view, build and launch it in the simulator, as well as use Playgrounds to write basic Swift.\n\nWelcome to Lambda School’s free Intro to iOS course. This course runs live regularly Monday through Thursday from 5-8pm PST (1700-2000 UTC -7). \n\nYou can register for the live sessions [here](https://lambdaschool.com/courses/cs/ios/101/), or use the video archives here to follow along asynchronously.\n\nYou'll be able to find everything you need each night from this Sprint overview page. In many technical jobs, a sprint is a unit of time to work on a set of given tasks. This Intro course is one sprint long, and contains eight lessons, listed below.\n\n__5PM Pacific__: Live Instruction\nOpen the [Zoom Webinar](https://zoom.us/j/693837456) to join the discussion. You may ask questions in Slack, or the Zoom webinar chat.\n\n__6PM Pacific__: Project Time\nComplete the project linked on the appropriate lesson page linked below. The project will help you practice and internalize what you learned during the live instruction.\n\nIf you need help during project time, you may ask in Slack or in the Zoom chat.\n\n__7PM Pacific__: Standup Meetings\nSmall group discussion to review the project, ask and answer questions, and get to know other people in your class. The meeting emulates the daily standup meeting we hold every day in the full-time classes, and is one of the many things that make Lambda School special.\n\n__First Night Attendance Form__:\nOn the first night of your class you will be asked to fill out a form, this is to be filled out on the firsts night only. This will count as your attendance and allow you to turn in your assignment. The form can be found here: [https://airtable.com/shroINmfxmWFSZA4C](https://airtable.com/shroINmfxmWFSZA4C)\n\n__Daily Standup Form:__\nAt the end of each evening you will be asked to fill out a \"daily standup form\" This form acts as your attendance, allows you to \"turn in\" your assignment, and allows you to leave valuable feedback for us. You can find this form here: [https://airtable.com/shrvcre7JYF0ofj5O](https://airtable.com/shrvcre7JYF0ofj5O)",
    "Modules": "Table Views,Custom Data Types,Collections,Strings,Loops and Functions,Conditionals and Optionals,Intro to Swift,Intro to iOS",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Precourse iOS",
    "Record ID": "rec2iSWmflrvHlEto",
    "Module Count": 8,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/9/2018 12:06pm",
    "Objectives Count": 52,
    "Sprint Order": ""
  },
  {
    "Name": "iOS Fundamentals I",
    "Description": "Welcome to iOS Development! This Sprint introduces fundamental technologies and concepts used to create basic iOS apps. \n\nYou start by learning about Xcode, the tool you'll be using to build applications on a daily basis. Xcode provides an integrated design environment (IDE) that transforms screen designs and code into working iOS applications. You'll also review version control. Version control helps you manage your app projects' source code and collaborate with others. You'll use this knowledge to participate in Lambda's projects and submit your work to your project managers.  Lambda School uses git, which is the most widely used version control system across iOS development. \n\nYou'll develop apps using view controllers, the building blocks of the iOS user interface and explore the rich library of interactive visual elements provided by Xcode's Interface Builder. You'll learn about the Model-View-Controller (MVC) architecture used to structure conventional iOS apps. MVC supports code development that is easy to understand, maintain, and extend with new features. \n\nYou'll discover two container controllers -- navigation controllers and tab bar controllers -- allowing your users to move between view controllers and their content. You'll study the navigation controller stack, and how a system of \"segues\" allow you to prepare and switch control from one view controller to the next.\n\nFinally, you'll dive into table views and table view controllers, which allow you to present information to users in a scrolling interactive list. Here you'll learn about delegation patterns, where the responsibility for providing data and responding to user actions can be handed off or, in the case of the Table View Controller, managed directly from a single view controller.",
    "Modules": "Auto Layout,Delegates and Protocols,iOS Development Tools,Swift Fundamentals III",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recmjxeO91PpDy8ks",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/11/2018 1:27pm",
    "Objectives Count": 23,
    "Sprint Order": ""
  },
  {
    "Name": "iOS Networking Basics",
    "Description": "Nearly all iOS apps connect to the internet. Whether your app is for e-commerce, messaging, social networking, allows a user to make restaurant reservations, make video calls, or stream music, it needs to connect to the internet.\n\nNetworking refers to the ability of an app to send data to and receive data from the internet.\n\nIn this sprint, you'll learn how to use iOS's networking system to communicate with internet servers using REST and JSON. You'll also be introduced to closures and basic concurrency in Swift.",
    "Modules": "Basic Authentication and REST Review,PUT/POST,REST Basics and Enums,Intro to GCD and Closures",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "rec8SOVctRZ64IuRt",
    "Module Count": 4,
    "Average Projected Level": 1.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/11/2018 1:28pm",
    "Objectives Count": 16,
    "Sprint Order": ""
  },
  {
    "Name": "Intermediate Swift",
    "Description": "For this sprint, we'll dive deeper into some Swift programming topics including more advanced uses of Codable, Swift Generics, and concurrency. For concurrency in particular, we'll talk about some of the fundamental ideas behind concurrency, common problems encountered when using multiple threads, as well as the two most common concurrency APIs on iOS: Grand Central Dispatch, and Operation/OperationQueue.",
    "Modules": "Concurrency III - iOS Concurrency,Concurrency II - Fundamentals,Swift Generics,Intermediate Codable",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recZdExe2c5Fx0V4W",
    "Module Count": 4,
    "Average Projected Level": 1.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/11/2018 1:28pm",
    "Objectives Count": 16,
    "Sprint Order": ""
  },
  {
    "Name": "Core Data",
    "Description": "Core Data is Apple's framework for persistence and object graph management. Fundamentally, it helps you save and load persistent data in your app. But Core Data's capabilities go far beyond persistence. It is a powerful, flexible framework that helps you implement the entire model layer in your applications. \n\nBesides persistence, it generates model class code for you, maintains the consistency of relationships between your objects, give you automatic undo/redo support, includes performance optimizations for large data sets, supports migrations between data formats, includes a powerful query system, and more.\n\nUsing Core Data, you can implement sophisticated model functionality without writing a ton of code. In this sprint, you'll learn the fundamentals of Core Data including creating Core Data models, the details of the Core Data \"stack\", how to create, modify, delete, and save model objects, query (fetch) objects, etc. You'll also practice using Core Data as a persistent store of network-synced data. Finally, we'll cover how to correctly use Core Data in concurrent code.",
    "Modules": "Core Data IV - Multiple Contexts and Concurrency,Core Data III - Sync Persistence,\"Core Data II - Migration, Fetching, and Predicates\",Core Data I - Basics",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "reckcvBkSjF0iCZGf",
    "Module Count": 4,
    "Average Projected Level": 2.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/11/2018 1:28pm",
    "Objectives Count": 18,
    "Sprint Order": ""
  },
  {
    "Name": "iOS Media Programming",
    "Description": "iOS is a powerful platform for media, including images, audio, and video. In this sprint, you'll learn how to use media in your iOS apps. We'll cover playing and recording audio, how to process and filter images, video playback, and capturing images and video from the camera.",
    "Modules": "MapKit,Video,Audio,Core Image",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recXg0dAYjKEFXVCV",
    "Module Count": 4,
    "Average Projected Level": 1.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/11/2018 1:28pm",
    "Objectives Count": 12,
    "Sprint Order": ""
  },
  {
    "Name": "iOS Fundamentals II",
    "Description": "This sprint expands upon the fundamental concepts you've already learned and delves into tools used to build iOS apps. You'll learn about Auto Layout, the technology that allows you to construct adaptive layouts across iOS's wide range of devices and geometries, and dive further into table views and collection views.",
    "Modules": "UICollectionView and UserDefaults,\"Alert Controllers, Picker Views, and Unwind Segues\",Basic Persistence,View Controller Containment and UITabBarController",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recU0XbniP9rWCksa",
    "Module Count": 4,
    "Average Projected Level": 1.8,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/11/2018 1:28pm",
    "Objectives Count": 19,
    "Sprint Order": ""
  },
  {
    "Name": "iOS Other Platforms",
    "Description": "iOS is just one of Apple's four major platforms: macOS, iOS, tvOS, and watchOS. In this sprint, you'll learn a little about writing apps for Apple's other platforms, including how to share code between apps on different platforms.",
    "Modules": "macOS,watchOS,Size Classes and UISplitViewController,App Extensions",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recTl8TSJEIw6qHpH",
    "Module Count": 4,
    "Average Projected Level": 0.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/11/2018 1:28pm",
    "Objectives Count": 5,
    "Sprint Order": ""
  },
  {
    "Name": "Modularity",
    "Description": "Good code is code that can be easily understood, debugged, maintained, extended, and refactored. Part of writing good code includes writing code that solves a big problem by composing solutions to small problems using modular code.\n\nIn this sprint, you'll learn techniques for keeping code well-factored and modular.",
    "Modules": "Cocoa Design Patterns,Creating Frameworks,Third Party Libraries and Dependency Management,Unit Testing III - Dependency Injection and Mocking",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recR8wktnfx83A2GO",
    "Module Count": 4,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/11/2018 1:28pm",
    "Objectives Count": 19,
    "Sprint Order": ""
  },
  {
    "Name": "Objective-C Part 2",
    "Description": "Swift was designed from the beginning to work seamlessly with Objective-C. Afterall, all of UIKit and the other iOS system frameworks on written in Objective-C, and so for Swift to be useful for iOS apps at all, it needs to interoperate with Objective-C.\n\nIn this sprint, you'll dive deeper into Objective-C, with a particular focus on how to use Objective-C and Swift together, as well as with concepts that are unique to Objective-C but influence code you'll write in Swift.",
    "Modules": "Cocoa Design Patterns in ObjC,Memory Management,KVO/KVC,Swift and ObjC Interoperability",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recLhkpzlG8wR1EDA",
    "Module Count": 4,
    "Average Projected Level": 0.8,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/11/2018 1:28pm",
    "Objectives Count": 17,
    "Sprint Order": ""
  },
  {
    "Name": "iOS User Interface",
    "Description": "Great apps have great user interfaces. From the very beginning, iOS has emphasized apps that are polished, good-looking, and fun. In this sprint, you'll learn how to create and customize user  interfaces, as well as how to do animations on iOS.",
    "Modules": "Animation II - View Controller Transitions,Animation I - View Animations,iOS Custom Controls,UIAppearance and Custom Fonts",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recHGMcGWnzCdsrgj",
    "Module Count": 4,
    "Average Projected Level": 1.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/11/2018 1:28pm",
    "Objectives Count": 17,
    "Sprint Order": ""
  },
  {
    "Name": "Objective-C Part 1",
    "Description": "In 2014, Apple introduced Swift, their new programming language for development on their platforms. Up until that point, native iOS and Mac development was done using Objective-C. Even now, Apple uses Objective-C for nearly all framework development, meaning UIKit, Core Data, etc. are themselves written entirely in Objective-C.\n\nObjective-C is a unique language with a lot to recommend it, as well as things that make it difficult. Despite the rapid adoption of Swift, Objective-C continues to be a vitally important language for working iOS developers. In your career, you're very likely to end up encountering Objective-C. Whether you're writing it exclusively, or just want to be able to read older sample code, Stack Overflow answers, etc., you need to be comfortable with Objective-C.\n\nIn this sprint, you'll learn the fundamentals of Objective-C, and will use it to write iOS apps.",
    "Modules": "Primitives, NSNumber, and Mutability\",\"Properties, Categories, and Extensions\",Objective-C Fundamentals,Intro to Objective C",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recFCRbpCdn9qohk6",
    "Module Count": 4,
    "Average Projected Level": 1.5,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/11/2018 1:28pm",
    "Objectives Count": 25,
    "Sprint Order": ""
  },
  {
    "Name": "iOS Code Quality",
    "Description": "Debugging and Unit Testing are core skills that you'll use to ensure the quality of the code you right. Xcode's debugging tools allow you to find, understand, and fix problems in your code. Unit Testing helps you ensure that your code is free of bugs in an automated way. This week, you'll learn how to do debugging and write unit tests.",
    "Modules": "Unit Testing II - UI Testing,Unit Testing I - Intro to Unit Testing,Debugging II - Instruments,Debugging I - Basic Debugging Tools",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recCi5lM0dLc9n1mA",
    "Module Count": 4,
    "Average Projected Level": 2.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/11/2018 1:28pm",
    "Objectives Count": 22,
    "Sprint Order": ""
  },
  {
    "Name": "Introduction to User Experience Design",
    "Description": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/2ogrsfkqy14\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n\nWelcome to Lambda School’s free Intro to User Experience Design course. This course runs live regularly Monday through Thursday from 5-8pm PST (1700-2000 UTC -7). \n\nThis course will introduce you to the product design cycle. It will help you understand some of the processes and heuristics UX designers use to create great digital experiences. The course provides an overview of user research, ideation, prototyping and user testing.\n\n\nYou can register for the live sessions [here](https://lambdaschool.com/courses/ux/intro/), or use the video archives here to follow along asynchronously.\n\nYou'll be able to find everything you need each night from this Sprint overview page. In many technical jobs, a sprint is a unit of time to work on a set of given tasks. This Intro course is one sprint long, and contains eight lessons, listed below.\n\n__5PM Pacific__: Live Instruction\nOpen the [Zoom Webinar](https://zoom.us/j/540397758) to join the discussion. You may ask questions in Slack, or the Zoom webinar chat.\n\n__6PM Pacific__: Project Time\nComplete the project linked on the appropriate lesson page linked below. The project will help you practice and internalize what you learned during the live instruction.\n\nIf you need help during project time, you may ask in Slack or in the Zoom chat.\n\n__7PM Pacific__: Standup Meetings\nSmall group discussion to review the project, ask and answer questions, and get to know other people in your class. The meeting emulates the daily standup meeting we hold every day in the full-time classes, and is one of the many things that make Lambda School special.\n\n__First Night Attendance Form__:\nOn the first night of your class you will be asked to fill out a form, this is to be filled out on the firsts night only. This will count as your attendance and allow you to turn in your assignment. The form can be found here: [https://airtable.com/shroINmfxmWFSZA4C](https://airtable.com/shroINmfxmWFSZA4C)\n\n__Daily Standup Form:__\nAt the end of each evening you will be asked to fill out a \"daily standup form\" This form acts as your attendance, allows you to \"turn in\" your assignment, and allows you to leave valuable feedback for us. You can find this form here: [https://airtable.com/shrvcre7JYF0ofj5O](https://airtable.com/shrvcre7JYF0ofj5O)",
    "Modules": "High Fidelity Design and UX Wrap Up,Usability Testing,Visual Hierarchy and Wireframes,Usability Heuristics,Introduction to Ideation,Defining the Product,Introduction to User Research,Introduction to UX",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Precourse UX",
    "Record ID": "recPJ18QZ6OBl4xpI",
    "Module Count": 8,
    "Average Projected Level": 1.1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "6/29/2018 5:40pm",
    "Objectives Count": 25,
    "Sprint Order": ""
  },
  {
    "Name": "Intro to Python/OOP",
    "Description": "Learn the Python programming language and the basics of the Object-Oriented Programming (OOP) paradigm.",
    "Modules": "Introduction to Python II,Introduction to Python I",
    "Search Test": "",
    "Sprint Challenge": "Intro to Python and Object-Oriented Programming",
    "Curriculum Sets": "Computer Science,DS - Computer Science",
    "Record ID": "recd4D4w3QrigPqUF",
    "Module Count": 2,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "Mathew Calkins,Feifan Zhou",
    "Advisory Council Reviews 2": "",
    "Created time": "6/29/2018 10:41pm",
    "Objectives Count": 7,
    "Sprint Order": 1
  },
  {
    "Name": "Intro to Android",
    "Description": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/2ogrsfkqy14\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n\nWelcome to Lambda School’s free Intro to Android Development course. This course runs live regularly Monday through Thursday from 5-8pm PST (1700-2000 UTC -7). \n\nThis course will give the student a brief overview of Android basics including using Android Studio, Interface Builder, and Java fundamentals. Set the student up to be able to begin, and succeed in, the Lambda school CS:Android program. By the end of this course the student should be able to build an Android app with a variety of layouts, build and launch it in an emulator and on a physical device.\n\n\nYou can register for the live sessions [here](https://lambdaschool.com/courses/cs/android/intro/), or use the video archives here to follow along asynchronously.\n\nYou'll be able to find everything you need each night from this Sprint overview page. In many technical jobs, a sprint is a unit of time to work on a set of given tasks. This Intro course is one sprint long, and contains eight lessons, listed below.\n\n__5PM Pacific__: Live Instruction\nOpen the [Zoom Webinar](https://zoom.us/j/625728403) to join the discussion. You may ask questions in Slack, or the Zoom webinar chat.\n\n__6PM Pacific__: Project Time\nComplete the project linked on the appropriate lesson page linked below. The project will help you practice and internalize what you learned during the live instruction.\n\nIf you need help during project time, you may ask in Slack or in the Zoom chat.\n\n__7PM Pacific__: Standup Meetings\nSmall group discussion to review the project, ask and answer questions, and get to know other people in your class. The meeting emulates the daily standup meeting we hold every day in the full-time classes, and is one of the many things that make Lambda School special.\n\n__First Night Attendance Form__:\nOn the first night of your class you will be asked to fill out a form, this is to be filled out on the firsts night only. This will count as your attendance and allow you to turn in your assignment. The form can be found here: [https://airtable.com/shroINmfxmWFSZA4C](https://airtable.com/shroINmfxmWFSZA4C)\n\n__Daily Standup Form:__\nAt the end of each evening you will be asked to fill out a \"daily standup form\" This form acts as your attendance, allows you to \"turn in\" your assignment, and allows you to leave valuable feedback for us. You can find this form here: [https://airtable.com/shrvcre7JYF0ofj5O](https://airtable.com/shrvcre7JYF0ofj5O)",
    "Modules": "Class Basics,Activity Layouts,Collections,Strings,Methods,Conditionals and Loops,Intro to Java,Intro to Android",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Precourse Android",
    "Record ID": "recxCgSftw66RQ9Io",
    "Module Count": 8,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/2/2018 3:42pm",
    "Objectives Count": 48,
    "Sprint Order": ""
  },
  {
    "Name": "Video Production",
    "Description": "A group of modules related to video production for Lambda School instructional recordings.",
    "Modules": "Preclass Video Production I",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Instructor Training",
    "Record ID": "recW3YvuBMEHtFat4",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/11/2018 10:57am",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Android Fundamentals I",
    "Description": "",
    "Modules": "Android Model View Controller,Git for Android Development,Activity Lifecycle,Intents",
    "Search Test": "",
    "Sprint Challenge": "Android Viewed Movie List",
    "Curriculum Sets": "Android Development Core",
    "Record ID": "recPEGsptroTpNXA8",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/13/2018 12:50pm",
    "Objectives Count": 25,
    "Sprint Order": ""
  },
  {
    "Name": "Android Fundamentals II",
    "Description": "",
    "Modules": "Notifications,\"Drawables, Themes, and Resource Files\",Showing Lists,Shared Preferences",
    "Search Test": "",
    "Sprint Challenge": "Android Shopping List",
    "Curriculum Sets": "Android Development Core",
    "Record ID": "recfWySNFDHdwr7Mh",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/13/2018 1:45pm",
    "Objectives Count": 22,
    "Sprint Order": ""
  },
  {
    "Name": "Android Networking",
    "Description": "",
    "Modules": "Broadcasts and Services,HTTP Requests,\"REST API Basics, GET Requests and JSON\",Threading Basics",
    "Search Test": "",
    "Sprint Challenge": "Android Pokemon API",
    "Curriculum Sets": "Android Development Core",
    "Record ID": "recQmODccUXTnI52v",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/16/2018 2:43pm",
    "Objectives Count": 14,
    "Sprint Order": ""
  },
  {
    "Name": "Data Persistence",
    "Description": "",
    "Modules": "Android Model View ViewModel Architecture,Android SQL Implementation,SQL Database,File Storage",
    "Search Test": "",
    "Sprint Challenge": "Android Persistence Sprint Challenge",
    "Curriculum Sets": "Android Development Core",
    "Record ID": "reccwvscsZ3C0Y3IF",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "Steven Miyakawa a.k.a. Sam Samskies",
    "Advisory Council Reviews 2": "",
    "Created time": "7/17/2018 11:02am",
    "Objectives Count": 22,
    "Sprint Order": ""
  },
  {
    "Name": "iOS Unit 1 Project Week: Core iOS",
    "Description": "The project this week will give you a chance to practice and apply the concepts you've learned the past four weeks. You'll build a complete, full-featured iOS app that does networking and uses Core Data for persistence.",
    "Modules": "iOS Fundamentals Project Week Kickoff",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recacnrDlqd98RbVE",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/17/2018 12:47pm",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "iOS Unit 3 Project Week: Objective-C and Beyond",
    "Description": "",
    "Modules": "Advanced iOS Development Project Week Kickoff",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recdWxGWhIlf3Lnuh",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/17/2018 1:00pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "iOS Unit 2 Project Week: Architecture and Design",
    "Description": "The project this week will give you a chance to practice and apply the concepts you've learned the past four weeks. You'll build an iOS social networking app including unit and UI tests.",
    "Modules": "Intermediate iOS Development Project Week Kickoff",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recoGLj03Afqu8m6Q",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/17/2018 1:00pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "RDBMS",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recLzDakTbgrnYbFm",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/20/2018 4:49pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Intro to Django",
    "Description": "In software development you’ll run into many different languages and ecosystems. Python is a popular language for general purpose computing, excelling in particular with data but with a huge community and packages for just about everything. Django is a “batteries-included” web application framework in Python, used by websites such as Instagram, Disqus, and Bitbucket.\n\nIn this sprint we will get set up with these tools, and then learn about two different approaches for designing web APIs. REST has been the dominant standard for a number of years. However, GraphQL has gained popularity recently due to its increased flexibility and efficiency.",
    "Modules": "Building APIs,Django basics and setup",
    "Search Test": "",
    "Sprint Challenge": "Deploy Django App to Heroku",
    "Curriculum Sets": "Computer Science Annex",
    "Record ID": "recKzV5STy8vYnbQ1",
    "Module Count": 2,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "Jonathan Bennett,Feifan Zhou,Andrew Askins,Vijay Swamidass",
    "Advisory Council Reviews 2": "",
    "Created time": "7/24/2018 4:50pm",
    "Objectives Count": 12,
    "Sprint Order": ""
  },
  {
    "Name": "Statistical Tests and Experiments",
    "Description": "An important application of statistics is designing and evaluating experiments - in the context of web applications, often this means an A/B test where users are exposed to different versions of a site and their behavior/outcomes compared.\n\nHow do you design a good, and valid, experiment? When have you run your experiment long enough? How do you evaluate the outcome of an experiment? How do you balance all this math and science with the practical business/product concerns you're working with? These are the sorts of questions we'll discuss in this sprint.",
    "Modules": "Real-world Experiment Design,Introduction to Bayesian Inference,\"Sampling, Confidence Intervals and Hypothesis Testing\",\"Probability, Statistics, and Inference",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Statistics Fundamentals",
    "Record ID": "recorynMW4uJ05ASZ",
    "Module Count": 4,
    "Average Projected Level": 3.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/26/2018 6:31pm",
    "Objectives Count": 8,
    "Sprint Order": ""
  },
  {
    "Name": "Linear Algebra",
    "Description": "Linear Algebra is the foundation of nearly all the numerical routines used for practical statistics and machine learning. It’s a deep topic, but this week we’ll learn enough to appreciate how it is used and applied to the many models we’ll learn.",
    "Modules": "Clustering,Dimensionality Reduction Techniques,Intermediate Linear Algebra,Vectors and Matrices",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Statistics Fundamentals",
    "Record ID": "recr0kuGaz6Uf4axZ",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "Dharmesh Kakadia",
    "Created time": "7/27/2018 12:32am",
    "Objectives Count": 14,
    "Sprint Order": ""
  },
  {
    "Name": "Regression",
    "Description": "Linear Regression is the fundamental, and still widely useful, predictive model. Linear Regression allows us to take something like `y = mx + b` and (given x and y) solve for m. That can be pretty powerful - for example we can, based on age, estimate weight. And, while we will learn many more advanced techniques, the intuition and math behind them is often based on this core approach.",
    "Modules": "Decision Trees,Regression Diagnostics,Polynomial & Log-Linear Regression,Ordinary Least Squares Regression",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "rec4dSxzmGcaJu6da",
    "Module Count": 4,
    "Average Projected Level": 0.5,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/27/2018 1:11am",
    "Objectives Count": 7,
    "Sprint Order": ""
  },
  {
    "Name": "Android User Interface",
    "Description": "",
    "Modules": "Custom Views,Layout Animations,Animated Images,Fragments",
    "Search Test": "",
    "Sprint Challenge": "Android Custom Rating View",
    "Curriculum Sets": "Android Development Core",
    "Record ID": "recmMArwYcvcbuQqD",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/30/2018 5:57pm",
    "Objectives Count": 20,
    "Sprint Order": ""
  },
  {
    "Name": "Intermediate Java",
    "Description": "",
    "Modules": "Concurrency,Java Generics,Abstraction and Interfaces,Inheritance and Polymorphism",
    "Search Test": "",
    "Sprint Challenge": "Intermediate Java Sprint Challenge Double Click",
    "Curriculum Sets": "Android Development Core",
    "Record ID": "recYWe2J9r9x16kU4",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/30/2018 6:05pm",
    "Objectives Count": 16,
    "Sprint Order": ""
  },
  {
    "Name": "Android Code Quality",
    "Description": "",
    "Modules": "UI Testing,Unit Testing,Performance Testing,Debugging Tools",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Android Development Core",
    "Record ID": "recBcK7imVGRTAsYL",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/30/2018 6:07pm",
    "Objectives Count": 22,
    "Sprint Order": ""
  },
  {
    "Name": "Additional Android",
    "Description": "",
    "Modules": "Google Play Store,Location Based Services,Menus,Media Programming",
    "Search Test": "",
    "Sprint Challenge": "Map Pin",
    "Curriculum Sets": "Android Development Core",
    "Record ID": "rec2Yoj0OJ03sZinM",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/30/2018 6:09pm",
    "Objectives Count": 25,
    "Sprint Order": ""
  },
  {
    "Name": "Architecture and Design",
    "Description": "",
    "Modules": "Sharing,Alternative Architectures,Writing APIs,Modularity and Lifecycle",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recVnd2SGyzjGneoy",
    "Module Count": 4,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/30/2018 6:10pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Kotlin",
    "Description": "Introduction to programming principles in Kotlin.",
    "Modules": "Kotlin Coroutines,Kotlin in Android,Kotlin Part 2,Kotlin Part 1",
    "Search Test": "",
    "Sprint Challenge": "Android Kotlin Sprint Challenge",
    "Curriculum Sets": "Android Development Core",
    "Record ID": "recYJzRdGnyIGofud",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/30/2018 6:16pm",
    "Objectives Count": 25,
    "Sprint Order": ""
  },
  {
    "Name": "Kotlin II",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recf5TEAJRK301KEs",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/30/2018 6:16pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Android Other Platforms",
    "Description": "",
    "Modules": "Java FX,Java Desktop,Daydream VR,wearOS",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "rechL5DOANgs6WvCx",
    "Module Count": 4,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/30/2018 6:17pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Advanced Regression",
    "Description": "As with hypothesis testing, there is a \"zoo\" of regression techniques. In this sprint we'll tour some highlights, and give you valuable tools for solving a variety of real-world problems.\n\nLogistic regression constraints the output (the dependent variable) using the logistic function, mapping the real numbers to the unit interval $(0, 1)$. This makes it suitable for binary classification problems, as well as fitting/predicting probabilities (such as likelihood of clicking something). It's also the foundation for more sophisticated classification models, capable of distinguishing between more than two classes.\n\nSurvival analysis, though morbidly named, is useful for modeling anything that has some duration followed by a (potential) event. Customer retention, time spent on site, system up-time, part failure - all of these can be treated as a survival analysis problem.\n\nQuantile regression is similar to ordinary least squares, but instead of estimating the mean the model estimates quantiles (e.g the median or other percentile cutoffs). This can make it more robust to outliers (as the median is more robust in those cases than the mean), and can give a richer analysis of the distribution of the variable being predicted.\n\nRidge regression is another enhancement to linear techniques, applying regularization to help solve ill-posed problems (situations where, for OLS $Ax = b$, $x$ either has no solution or multiple solutions). Regularization can also help prevent overfitting, another important consideration.\n\nThe above still just scratches the surface of what is out there, but is a good starting point and foundation for your own exploration. With these tools you can solve a variety of real-world problems, and provide meaningful value to anyone looking for insight from a data scientist.",
    "Modules": "Regularization & Survival Analysis,Quantile Regression,Survival Analysis,Logistic Regression",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "rec1n1XpuGz9uPzck",
    "Module Count": 4,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/31/2018 6:27pm",
    "Objectives Count": 8,
    "Sprint Order": ""
  },
  {
    "Name": "Classification & Validation",
    "Description": "A model is only as good as its generalizability - we will learn a variety of approaches to validate that a model will generalize as it should. Without validation, it’s possible to fit misleading models and report inaccurate results - and as Data Scientists, our colleagues expect and trust us to handle these issues and give accurate models.",
    "Modules": "Random Forests & Gradient Boosting,Classification metrics & Imbalanced classes,Baselines & Validation,Logistic Regression",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "rec6hp8t7IDTwiPnF",
    "Module Count": 4,
    "Average Projected Level": 1.8,
    "Advisory Council Reviews": "Zach Knowlton",
    "Advisory Council Reviews 2": "",
    "Created time": "7/31/2018 6:28pm",
    "Objectives Count": 10,
    "Sprint Order": ""
  },
  {
    "Name": "Data Storytelling",
    "Description": "Data Scientists can derive insight from data - but to have an impact, you have to share those insights with others. With Data Storytelling, we learn how to effectively frame and portray a narrative based on our analysis, and augment it with visualizations.",
    "Modules": "Sequence your narrative,Make explanatory visualizations,Choose appropriate visualizations",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recmV3C1f0V0WI9kI",
    "Module Count": 3,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/31/2018 6:28pm",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "Creating Professional Portfolios",
    "Description": "",
    "Modules": "Revise your writing,Connect with professionals,Publish blog posts,Begin your portfolio",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Annex",
    "Record ID": "rec4hdPIn5zP7PmIl",
    "Module Count": 4,
    "Average Projected Level": 1.5,
    "Advisory Council Reviews": "Alex Lorestani,Zach Knowlton",
    "Advisory Council Reviews 2": "",
    "Created time": "7/31/2018 6:28pm",
    "Objectives Count": 8,
    "Sprint Order": ""
  },
  {
    "Name": "Software Engineering and Reproducible Research",
    "Description": "A data scientist knows more about statistics than a software engineer, and more about programming than a statistician.\"\n\nBeing a data scientist means *applying* statistics and analysis of data, writing real working code that runs and gets results. You've been doing that your entire time at Lambda School - but much of our work has been in the land of Python notebooks, a useful but limited environment intended for exploration, not engineering.\n\nSome place a divide between science and engineering - theory and practice, ideas and application. A skilled data scientist masters both - science informs the engineering, and engineering increases the rigor of the science by making it reproducible and scalable.\n\nIn this unit we will build the core skills needed to communicate and work with software engineers. You may have pleasantly surprised colleagues if you not only know the latest and greatest machine learning model, but build and approach it with software development best practices.\n\nTo do this, we will go beyond Python notebooks, into the world of modules, packages, containers, and beyond. Onwards!",
    "Modules": "Software Testing, Documentation, and Licensing\",Containers and Reproducible Builds,\"OOP, Code Style and Reviews\",\"Python Modules, Packages, and Environments",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Data Engineering",
    "Record ID": "recA7O3QeO8AQxsxE",
    "Module Count": 4,
    "Average Projected Level": 3,
    "Advisory Council Reviews": "Dharmesh Kakadia,Mathew Calkins",
    "Advisory Council Reviews 2": "",
    "Created time": "7/31/2018 6:28pm",
    "Objectives Count": 9,
    "Sprint Order": ""
  },
  {
    "Name": "SQL and Databases",
    "Description": "What does \"data\" look like? If you try to picture it, you probably see rows and columns - a spreadsheet or CSV, that can be conveniently loaded with `pandas` and cleaned and analyzed from there. As a data scientist, this will often be the form you want your data to be in - but it's probably not how your data started.\n\nMost modern data is generated automatically by human interaction with a web-backed application - every app they take, every click they make, all travels over a network and is saved by the server. Though in the rawest of forms this may be a log file, in most cases where it really goes is a database.\n\nSo, what is a database? A place for data! If it's relational, it's actually still pretty close to that rows and columns picture, though with some important additional functionality. These databases are commonly accessed using SQL - Structured Query Language - a standard based on relational algebra, and a useful tool known not just by data scientists but by software engineers, MBAs, and more.\n\nIf it's so-called \"NoSQL\", then it's most likely a document-oriented database (or document store) - which, despite the glamor, is essentially a bunch of key-value pairs. What key-value pair object are you already familiar with? Python dicts!\n\nIn this sprint we will learn about both of the above paradigms, and how the separation between them is not as bright a line as you may think.",
    "Modules": "ACID and Database Scalability Tradeoffs,NoSQL and Document-oriented databases,SQL for Analysis,Introduction to SQL",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Data Engineering",
    "Record ID": "recV8wEgPdwWmUInW",
    "Module Count": 4,
    "Average Projected Level": 3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/31/2018 6:28pm",
    "Objectives Count": 8,
    "Sprint Order": ""
  },
  {
    "Name": "Productization and Cloud",
    "Description": "For a computer program to be \"real\", it has to be available - these days, that means deployed to the cloud. But what is the cloud, and what does it mean to build and deploy something to it? We'll learn that and more in this sprint.",
    "Modules": "Web Application Deployment,Adding Data Science to a Web Application,Consuming Data from an API,Web Application Development with Flask",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Data Engineering",
    "Record ID": "recvbdRfBNCqSB4hd",
    "Module Count": 4,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "Mathew Calkins",
    "Advisory Council Reviews 2": "",
    "Created time": "7/31/2018 6:28pm",
    "Objectives Count": 8,
    "Sprint Order": ""
  },
  {
    "Name": "Big Data: AWS & Spark",
    "Description": "So far we’ve looked at a lot of data and models, but most of it has been fairly “small” - it fits in a regular computer. This week we will use Amazon Web Services to run much larger instances, and even clusters of workers, in order to analyze some big data! We’ll also learn about Apache Spark, a fast scalable open-source cluster computing framework.",
    "Modules": "Apache Spark, day 2\",\"Apache Spark, day 1\",Just enough Scala for Spark,AWS SageMaker",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Data Engineering",
    "Record ID": "recADjP90jTWtUcWL",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "Dharmesh Kakadia,Mathew Calkins",
    "Advisory Council Reviews 2": "",
    "Created time": "7/31/2018 6:29pm",
    "Objectives Count": 11,
    "Sprint Order": ""
  },
  {
    "Name": "DS Project 3 - Build Week 1",
    "Description": "Now that you've learned more about software engineering, it's time to work with students in other programs at Lambda School and build something that incorporates data science.",
    "Modules": "\"\"Productionize\"\" Earlier Analysis",
    "Search Test": "",
    "Sprint Challenge": "DS Project 4 - Reproducible Data Science",
    "Curriculum Sets": "DS - Data Engineering",
    "Record ID": "recUobfsXtPc0GUEF",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/31/2018 6:29pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Dealing with Data",
    "Description": "The beginning (and middle, and end) of data science involves understanding data. What is it? Is *everything* data? If so, how can we work with it systematically and analyze it consistently?",
    "Modules": "Make features,Making data-backed assertions,Loading data from a variety of sources,A First Look at Data",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Statistics Fundamentals",
    "Record ID": "recdUopSfNqeQDWwn",
    "Module Count": 4,
    "Average Projected Level": 3.5,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/31/2018 6:30pm",
    "Objectives Count": 9,
    "Sprint Order": ""
  },
  {
    "Name": "DS Project 2 - Predictive modeling challenge",
    "Description": "**Can you predict which water pumps are faulty?** Using data from Taarifa and the Tanzanian Ministry of Water, can you predict which pumps are functional, which need some repairs, and which don't work at all? Predict one of these three classes based on a number of variables about what kind of pump is operating, when it was installed, and how it is managed. A smart understanding of which waterpoints will fail can improve maintenance operations and ensure that clean, potable water is available to communities across Tanzania.\n\nThis predictive modeling challenge comes from DrivenData, an organization who helps non-profits by hosting data science competitions for social impact. The challenge has open licensing: \"The data is available for use outside of DrivenData.\" We are reusing the data on Kaggle's InClass platform so we can run a [**weeklong challenge just for our Lambda School DS2 cohort**](https://www.kaggle.com/t/eda93ce0f12043f3bdccf2fe9514e2a2).",
    "Modules": "DS Project 2 - Predictive modeling challenge - Day 4,DS Project 2 - Predictive modeling challenge - Day 3,DS Project 2 - Predictive modeling challenge - Day 2,DS Project 2 - Predictive modeling challenge - Day 1",
    "Search Test": "",
    "Sprint Challenge": "DS Project 2 - Predicting Data",
    "Curriculum Sets": "",
    "Record ID": "recqM2q87vqT3mWvi",
    "Module Count": 4,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/31/2018 6:33pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "DS Project 1 - Data Storytelling Portfolio Project",
    "Description": "This week, you will complete your own data storytelling project! Create a notebook and publish a blog post for your personal portfolio.",
    "Modules": "Polish Blog Post and Refactor Notebook - Data Storytelling Project Day 4,Second Visualization and Blog Post Outline - Data Storytelling Project Day 3,Summary and first Visualization - Data Storytelling Project Day 2, Exploratory Data Analysis - Data Storytelling Project Day 1",
    "Search Test": "",
    "Sprint Challenge": "Data Storytelling Project Presentation and Deliverables",
    "Curriculum Sets": "DS - Statistics Fundamentals",
    "Record ID": "recLBojP7nFYhz1EM",
    "Module Count": 4,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "7/31/2018 6:33pm",
    "Objectives Count": 9,
    "Sprint Order": ""
  },
  {
    "Name": "Intro to Data Science",
    "Description": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/2ogrsfkqy14\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n\nWelcome to Lambda School’s free Intro to Data Science course. This course is available online, with a Slack community for support and periodic live meetings.\n\nYou can register for the course [here](https://lambdaschool.com/courses/data-science/intro/), and use the videos to follow along asynchronously.\n\nYou'll be able to find everything you need each night from this Sprint overview page. In many technical jobs, a sprint is a unit of time to work on a set of given tasks. This Intro course is one sprint long, and contains eight lessons, listed below.\n\n__Colab Notebooks:__\nEach lesson new Colab notebooks will be shared with you. You will be able to find the link's to those here.\n\n- Lecture 1:\n  - Material: \n[LSDS Intro Lecture 1 - Intro to Python](https://colab.research.google.com/drive/1f_9CXFJzBvrAePaDr_WYQGHEBS5th53b#scrollTo=ZvNsvUNNlZbi)\n  - Assignment: \n[LSDS Intro Assignment 1 - Getting Started with Python](https://colab.research.google.com/drive/1MADElEPZEQqKePN5_bL9Gcu-1TSN19M1#scrollTo=I6biutgwdgpb)\n\n- Lecture 2:\n  - Material: [LSDS Intro Lecture 2 - Intro to Data Exploration](https://colab.research.google.com/drive/14Q---bc4G1sU5aEOz3w8D_1Q0l1_SM-B)\n  - Assignment: [LSDS Intro Assignment 2 - Intro to Data Exploration](https://colab.research.google.com/drive/1klzjBonq6-eFeHvaAlwb9HMnkgBg-X2I)\n\n- Lecture 3:\n  - Material: [LSDS Intro Lecture 3 - Intro to Statistics](https://colab.research.google.com/drive/163eXNZBfczO5Noei63Y6A5dtUzEy58tq#scrollTo=vHOQ5ok2k6rn)\n  - Assignment: [LSDS Intro Assignment 3 - Statistics of Forest Fires](https://colab.research.google.com/drive/1HEVfm7sW_kzHdBId7Kb7gwRl7h7b3ANx#scrollTo=rMWYZKVX-HGM) \n\n- Lesson 4:\n  - Material: [LSDS Intro Lecture 4 - Inferential Statistics](https://colab.research.google.com/drive/1C_7E0qHtMH4qNwuVJAvv7lG6XO7S-eKw)\n  - Assignment: [LSDS Intro Assignment 4 - Inferential Statistics](https://colab.research.google.com/drive/1qqX8nDOw7z4t0tOUVBEwfo8uV3FM0GZl)\n\n- Lesson 5:\n  - Material: [LSDS Intro Lecture 5 - Linear Algebra 1](https://colab.research.google.com/drive/1aIKdXIAPhHgZQT5gMZIW1F50SfZuuYJL)\n  - Assignment: [LSDS Intro Assignment 5 - Linear Algebra Foundations](https://colab.research.google.com/drive/1u0XBbdsC1E6t2CoH62kYwJ0BBVxkqpYQ)\n\n- Lesson 6:\n  - Material: [LSDS Intro Lecture 6 - Linear Algebra 2](https://colab.research.google.com/drive/1Qx4ZogIpzsBkLaoi_aeHp5NDdGpoTynZ)\n  - Assignment: [LSDS Intro Assignment 6 - Linear Algebra 2](https://colab.research.google.com/drive/1QYWrZjShI8-Ao1FrjL8liJNnS--n5jjx)\n\n- Lesson 7:\n  - Material: [LSDS Intro Lecture 7 - More Regression](https://colab.research.google.com/drive/1yg75YgfyeKB1YU9w7ju6Lb_1pGl__YZq)\n  - Assignment: [LSDS Intro Assignment 7 - More Regression](https://colab.research.google.com/drive/1OWWg2skvgXyVSJBva9TUj7SPvR19Mdbl)\n\n- Lesson 8:\n  - Material: [LSDS Intro Lecture 8 - Classification](https://colab.research.google.com/drive/1Ws9_XE28ymNOrtvWz9gcr2WaNcSdIglz)\n  - Assignment: [LSDS Intro Assignment 8 - Classification](https://colab.research.google.com/drive/14GTb5Zq-8Xif7DmPTcRfxawvpA1N-zwU)",
    "Modules": "DS Final Project Day 2,DS Final Project Day 1,Linear Algebra Applications,Linear Algebra Foundations,Hypothesis Testing,Statistics Fundamentals,Intro to Jupyter Notebooks and Pandas,Intro to Python",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Precourse DS",
    "Record ID": "recimtnGaWpVMMDZw",
    "Module Count": 8,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "8/27/2018 1:26pm",
    "Objectives Count": 36,
    "Sprint Order": ""
  },
  {
    "Name": "Empathy",
    "Description": "",
    "Modules": "Treating Others w/ Respect,Working on a Team,Trusting your co-workers,Working with people from different backgrounds,Learning to Respect the Time of Others,Friendship comes from time not affiliation,Knowing the difference between appropriate and inappropriate banter/jokes,4 Ways to Build Empathy in Yourself to Improve Your Workplace,Empathy in the workplace = More productive employees,\"How to strengthen your Empathy \"\"muscle\"\" to be a good leader\",Why Empathy in the Workplace Matters,Dynamics of working on a Dev Team.",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recmFjv6CkjyjfShg",
    "Module Count": 12,
    "Average Projected Level": 0.1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "8/30/2018 4:15pm",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "Diversity",
    "Description": "",
    "Modules": "Women in Tech,Ageism,Resources for Underrepresented Engineers in Tech,Why are companies struggling to hire diversity candidates?,The Importance of Diversity in the Workplace,Eye-opening statistics around Diversity in Tech,Harassment in the Workplace and what to do about it",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recnDN0AH3ybfId3W",
    "Module Count": 7,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "8/30/2018 4:15pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Communication",
    "Description": "",
    "Modules": "Giving Feedback,Taking feedback,How to have a hard conversation,How to be a better listener,Handle conflicts with Diplomacy,Revive the Great Lost Art of Conversation,Take Your Emotions Out of the Equation,Using Communication to Create Better Client Relationships,Making and Communicating decisions as a Team,Learning how to be an effective Leader through Communication,Master the Art of Asking Questions",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recIMoZ45BEYjLgeY",
    "Module Count": 11,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "8/30/2018 4:15pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Professionalism",
    "Description": "",
    "Modules": "How to write a proper email,How to Dress for an Interview,Social Media Tips for the professional world,The importance of spell check and grammar for an Engineer,\"How to attend a \"\"Happy Hour\"\" like event and still be professional\",How to not burn bridges with a company/co-worker,The importance of being a good writer as an Engineer",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recHo1TT7XTwbbKBk",
    "Module Count": 7,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "8/30/2018 4:15pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Optimize Your Life and Career",
    "Description": "",
    "Modules": "Personal Finance,Lifelong Learning,Contributing to Open Source,Sharpen Your Tools,Learning how to Prioritize Problems,Why Time Management is so Important,The importance of Networking/Going to Events,Creating and maintaining a strong portfolio,1099 VS. W2 - how to navigate being a contractor",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recvXIbAOszoLlnAe",
    "Module Count": 9,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "8/30/2018 4:15pm",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Fundamentals: Discovery",
    "Description": "A “user experience” exists with any product whether or not the product team is deliberate in how that experience gets created. Too often, the product is built haphazardly without due consideration given to the context in which it will be used. Some companies have discovered that intentional design of a digital product will result in enormous benefits for the brand, for the product, and ultimately for the bottom line. User experience design (or UX) is essentially a rough-hewn smorgasboard of tools, techniques and processes by which teams can intentionally and economically design an experience for their product’s users that surpasses what would otherwise emerge organically. \n\nThe goal of this sprint is to introduce you to a few fundamental UX design processes and give you practice using some of them. We will answer questions about how the UX tools fit into the overall product design process. We will introduce UX within the context of the responsive web. \n\nTopics covered: \n\nIntroduction to the User Experience\nReview of the Product Design Cycle: Discovery, Definition, Ideation, Prototyping, Development, Testing.\nFocus on Discovery",
    "Modules": "Organizing and Presenting Findings; Building a Portfolio,Assumptions and Competitive Analysis,Intro to Lambda and User Experience Design (UX),Unnamed record",
    "Search Test": "",
    "Sprint Challenge": "UX Discovery Fundamentals Assessment",
    "Curriculum Sets": "UX Design Core [v1 deprecated]",
    "Record ID": "recHEXSzyeoZ9hGnb",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/4/2018 2:57pm",
    "Objectives Count": 11,
    "Sprint Order": ""
  },
  {
    "Name": "Web Server",
    "Description": "Web servers are a technology students are relatively familiar with from their time in other Lambda tracks. The purpose of this sprint is to dig a bit deeper into the concepts that underly web servers: the networking stack, REST APIs, and caching. \n\nSince this sprint will be conducted in C, part of the challenge for students will be to move network packets 'manually' by reading and writing bytes to and from network sockets.",
    "Modules": "Web Server II,Web Server I",
    "Search Test": "",
    "Sprint Challenge": "C Web Server Sprint Challenge",
    "Curriculum Sets": "Computer Science",
    "Record ID": "recTXsleEkanZP75b",
    "Module Count": 2,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/17/2018 4:00pm",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "Next Week I",
    "Description": "Welcome to Lambda Next! This is where you'll be putting everything you've learned the past 6 months to work. You'll be assigned a PM to follow up with your daily and weekly progress. \n\nThis week your goals are to:\n-Build a portfolio site where you can showcase your best work\n-Write a blog post or create a YouTube video covering the topic \"What I Learned in Lambda School",
    "Modules": "Build a Portfolio Website,\"\"\"What I Learned at Lambda School\"\" Publication\",Daily Objectives",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Lambda Next",
    "Record ID": "recYAVDyqBLE0zUqT",
    "Module Count": 3,
    "Average Projected Level": 0.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/20/2018 11:41am",
    "Objectives Count": 5,
    "Sprint Order": ""
  },
  {
    "Name": "Next Week II",
    "Description": "This week your goals are the following:\n-Contribute to a codebase that is new to you\n-Write a blog post or create a YouTube video covering the topic \"How I Contributed to and Learned a New Codebase\" or similar topic.",
    "Modules": "Daily Objectives,\"\"\"How I Contributed to a Code Base That Was New to Me\"\" Publication\",Contribute to Code Base That Is New to You",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Lambda Next",
    "Record ID": "rec69NXTYEPdeasAh",
    "Module Count": 3,
    "Average Projected Level": 0.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/20/2018 11:41am",
    "Objectives Count": 5,
    "Sprint Order": ""
  },
  {
    "Name": "Next Week III",
    "Description": "This week your goals are the following:\n-Learn a new language, framework, or tech stack. Then use that to build and publish a new project.\n-Write a blog post or create a YouTube video about your experience. \"How I Learned a New Language or Tech Stack in a Week\" or similar topic.",
    "Modules": "Daily Objectives,\"\"\"How I Learned a New Tool/Language/Framework in 1 Week\"\" Publication\",\"learn a new language, tool, or framework",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Lambda Next",
    "Record ID": "recpEBn4k5cou9jIV",
    "Module Count": 3,
    "Average Projected Level": 0.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/20/2018 11:42am",
    "Objectives Count": 5,
    "Sprint Order": ""
  },
  {
    "Name": "Next Week IV",
    "Description": "This week your goals are the following:\n-Contribute to an open source project.\n-Write a blog post or create a YouTube video about your experience. \"How I Contributed to My First Open Source Project\" or similar topic.",
    "Modules": "Daily Objectives,\"\"\"How I Contributed to My First Open Source Project\"\" Publication\",Contribute to an Open Source Project",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Lambda Next",
    "Record ID": "recFfdFjGKS3RGPAf",
    "Module Count": 3,
    "Average Projected Level": 0.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/20/2018 11:42am",
    "Objectives Count": 5,
    "Sprint Order": ""
  },
  {
    "Name": "Next Week V",
    "Description": "This week your goals are the following:\n-Publishing an open-source tool\n-Write a blog post or create a YouTube video about your experience. \"I Published My First Open Source Tool\" or similar topic.",
    "Modules": "Daily Objectives",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Lambda Next",
    "Record ID": "reczSWy1eB5WbHfmF",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/20/2018 11:43am",
    "Objectives Count": 3,
    "Sprint Order": ""
  },
  {
    "Name": "Next Week VI",
    "Description": "This week your goals are the following:\n-How to plan a project\n-Write a blog post or create a YouTube video about your experience. \"How I Took a Set of Business Requirements, Planned a Project, and Turned it Into Code\" or similar topic.",
    "Modules": "Daily Objectives",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Lambda Next",
    "Record ID": "rec9zhM85zmepFMCz",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/20/2018 11:43am",
    "Objectives Count": 3,
    "Sprint Order": ""
  },
  {
    "Name": "Project Week: LambdaMUD",
    "Description": "In this project week, you'll be creating a _Multi-User Dungeon_ (MUD).",
    "Modules": "LambdaMUD",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Computer Science Annex",
    "Record ID": "recm4nrk0VPEMz8w8",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "Karan Kurani",
    "Advisory Council Reviews 2": "",
    "Created time": "9/24/2018 11:20am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Unsupervised Learning",
    "Description": "So far we've focused on analyzing and modeling data that has labels - there is \"ground truth\" for what something really is, and we just want to use statistics and computation to get deeper insight and predictive power.\n\nBut a lot of real-world data doesn't come labeled. Let's say you want to detect fraudulent or malicious usage of a web application. You have usage logs - entries of each impression on the system by a user, recording what they did and what the system can track about them (browser, device, IP address, geographic locale, if they're logged in, what they clicked on last, etc.). What the logs definitely don't have is a nice 0/1 label of \"is_fraudulent\" - so how can you start solving this problem?\n\nFrom a machine learning perspective, you are facing what is called unsupervised learning - you have data, but no labels to indicate the class or \"meaning\" of a given observation. A computational system powerful enough to understand unstructured data may seem like the holy grail of machine learning - and truly general and powerful unsupervised learning is an unsolved problem, and one that is likely to see continued progress.\n\nEffective application of unsupervised learning often depends not just on technique but domain knowledge, and may be best seen as an early stage in an overall machine learning pipeline. Consider the fraud logs example - maybe, after clustering the logs based on a few features, you get a computer security specialist to consider a few observations from each major cluster and see if they can help you label what the clusters actually mean. From there you can build a labeled data set and use that to train a predictive supervised model.\n\nFor now, unsupervised learning is often secondary to supervised learning (models with labels - what we've been doing), as the latter yields more practical useful predictions in most scenarios. But there are some relatively simple and still quite useful unsupervised learning techniques - mostly related to clustering - that we will cover.",
    "Modules": "Dimensionality Reduction Techniques,Clustering",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Annex",
    "Record ID": "recDHFxsTGkUtLrLI",
    "Module Count": 2,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/24/2018 12:11pm",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "Natural Language Processing",
    "Description": "A particularly common unstructured data is the sort of information you are consuming right now - natural language, in written or spoken form.\n\nHuman language is a fascinating phenomenon and powerful expressive tool, but despite the many rules of grammar language is *not* a fully defined deterministic system in the same way that programming languages (like Python) are. Language can be thought of as semi-structured, but even the structure it has (nouns, adjectives, verbs, etc.) can be difficult to recognize. Most humans are fluent in one or more languages, but even that fluency doesn't mean they can explicitly list or consciously understand the \"rules\" they are following.\n\nNonetheless, human language is the main form of content on the Internet (and beyond), and the ability to computationally process it at scale can lead to many compelling products. A brand may want to track the sentiment of users towards them on social media before/after an advertising campaign, or a news service may want to recognize key entities in a news story to generate a high-quality automated summary. But text is not numbers - and even representing it as e.g. ASCII/Unicode values doesn't capture the meaning, just the abstract labeling of symbols. How can we hope to achieve these sorts of tasks?\n\nIn this sprint we will learn assorted NLP (Natural Language Processing) techniques - many involving cleaning and preprocessing, which can then allow us to feed the data into the more traditional statistical models we are familiar with. There are also more advanced specialized models that are particularly conducive to NLP which we will address.",
    "Modules": "Topic Modeling,Document Classification,Vector Representations,Natural Language Processing - Introduction",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Machine Learning",
    "Record ID": "recBptZbfRxhQFbIE",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/24/2018 12:11pm",
    "Objectives Count": 12,
    "Sprint Order": ""
  },
  {
    "Name": "Tree Ensembles",
    "Description": "Decision Trees are a fairly basic predictive technique - but combine them in a forest, and watch their powers grow. Many winning Kaggle contest entries were based on techniques involving ensembles of “weak” learners like trees. We’ll learn these essential and highly effective techniques, and apply them to interesting predictive problems.",
    "Modules": "Gradient Boosting,Model interpretation,Random Forests & Gradient Boosting,Decision Trees",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recrjAqMx8qvSjaeE",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/24/2018 12:12pm",
    "Objectives Count": 8,
    "Sprint Order": ""
  },
  {
    "Name": "Major Neural Network Architectures",
    "Description": "Now that you've learned the foundations of Neural Networks, it's time to go deep! All \"deep learning\" really means is \"there's at least some hidden layers\" - but there's a great deal of variety both in the layer architecture and the behavior of individual \"neurons\" in the network.\n\nWe'll study a few of the most effective recent innovations in neural networks and deep learning, and think a bit about what the future may hold. Is deep learning the path to artificial general intelligence? Probably not - but it's a pretty useful tool along the way.\n\n<img src=\"https://www.dropbox.com/s/al7ofgi2jizmqbf/Screenshot%202018-03-21%2013.01.07.png?raw=1\" text=\"Artful rendering of some neurons\">",
    "Modules": "Generative Adversarial Networks,AutoEncoders & Recommendation Systems,Convolutional Neural Networks,Recurrent Neural Networks and LSTM",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Machine Learning",
    "Record ID": "rec5inpL5t6W30CFH",
    "Module Count": 4,
    "Average Projected Level": 0.8,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/24/2018 12:12pm",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "DS Project 4 - Build Week 2",
    "Description": "You now know a variety of powerful techniques for modeling and predicting data - your goal this week is to apply them to another build week project, working with students across the school.",
    "Modules": "DS Build Week 2",
    "Search Test": "",
    "Sprint Challenge": "DS Project 4 - Advanced Prediction",
    "Curriculum Sets": "DS - Machine Learning",
    "Record ID": "rec16ljHxQK6XRfQe",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/24/2018 12:12pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Theory of Computation/Hash Tables",
    "Description": "In the first half of the course, you learned Python: a high-level language that lets you soar through the skies (`import antigravity`) and examine the world of computer science from above. You examined complex algorithms, evaluated code performance for huge values of N, learned to traverse expansive graph networks and much more. We moved blazing fast but you got a big-picture glimpse of the unbridled power and potential of computing.\n\nLast week, you were introduced to C: a low-level language that lets you shrink down to gain insight into the inner workings of computers and code that make such power possible.\n\nThis week, we will be exploring the historical and theoretical origins of logic, computation, computers and code to see how we got where we are today. Along the way, you will learn to implement two of the most important data structures known to mankind: arrays and hash tables.\n\nStrap in because after this week, you'll never look at code or computers the same again.",
    "Modules": "Hash Tables,Theory of Computation",
    "Search Test": "",
    "Sprint Challenge": "Sprint Challenge: Hash Tables and Theory of Computation",
    "Curriculum Sets": "Computer Science",
    "Record ID": "recAr3gdL8U57eho1",
    "Module Count": 2,
    "Average Projected Level": 3,
    "Advisory Council Reviews": "Adam Hobson,Vijay Swamidass,Karan Kurani",
    "Advisory Council Reviews 2": "",
    "Created time": "9/26/2018 3:00pm",
    "Objectives Count": 4,
    "Sprint Order": ""
  },
  {
    "Name": "Fundamentals: Defining the Experience",
    "Description": "In this sprint, we'll continue learning fundamental concepts and methodologies used in the UX process. We'll revisit user personas and take a closer look at how to design and use them. Then we'll learn how to visualize a user's path through our products with user flows so we can avoid missing key interaction moments. Finally, we'll cover the foundational aspects of Information Architecture and Content Strategy.",
    "Modules": "Intro to Content Strategy,Intro to Information Architecture (IA),Documenting and Diagramming a User Flow,Creating and Using Personas",
    "Search Test": "",
    "Sprint Challenge": "UX Definition Assessment",
    "Curriculum Sets": "UX Design Core [v1 deprecated]",
    "Record ID": "recX14lYNUjS7UZgf",
    "Module Count": 4,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/27/2018 8:11am",
    "Objectives Count": 17,
    "Sprint Order": ""
  },
  {
    "Name": "Fundamentals: Design Principles",
    "Description": "To produce great user experiences, we need to have an understanding of how the human mind works and how to build effective designs. In this sprint, we'll learn about the human memory and how it impacts our design decisions. Then, we'll review visual hierarchy, typography, and color theory. We'll also learn how to design \"responsively\" and continue practicing how to build wireframes and prototypes with Sketch and InVision.",
    "Modules": "Wireframes and Click-through Prototyping,\"Designing for the Responsive Web, Visual Hierarchy in a Dynamic Screen World\",\"Visual Hierarchy, Typography, Color Theory\",Designing for the Human Mind",
    "Search Test": "",
    "Sprint Challenge": "Design Principles I Assessment",
    "Curriculum Sets": "UX Design Core [v1 deprecated]",
    "Record ID": "recvnwpEQ3GhlM5sh",
    "Module Count": 4,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/27/2018 8:18am",
    "Objectives Count": 13,
    "Sprint Order": ""
  },
  {
    "Name": "UX Unit 1 Project Week: UX Fundamentals",
    "Description": "You have been exposed to the full product design cycle now and should be able to conduct a UX design project from beginning to end on your own. This week, you will conduct discovery and ideation for a new product and create the relevant defining documentation. Then you will build a click-through prototype at the wireframe level.",
    "Modules": "Project Week — Design a Publication Platform",
    "Search Test": "",
    "Sprint Challenge": "Sprint Challenge — Design a Publication Platform",
    "Curriculum Sets": "UX Design Core [v1 deprecated]",
    "Record ID": "recvQldCA8lVkKRx7",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/28/2018 4:05pm",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "UX Unit 2 Project Week",
    "Description": "You have been exposed to the full product design cycle now and have also been instructed in some advanced techniques that can help make a UX design project move both more quickly and more smoothly. This week, you will conduct discovery and ideation and prototyping for an existing product. You will document and defend your process as you come to a solution. Your final deliverable will be a high-fidelity prototype in Invision along with a blog post outlining the design decisions made throughout the process.",
    "Modules": "Project Week — Design a Lambda School Application",
    "Search Test": "",
    "Sprint Challenge": "Lambda UX Application",
    "Curriculum Sets": "UX Design Core [v1 deprecated]",
    "Record ID": "rec4AY5TgYB1INWXS",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/28/2018 4:10pm",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Design in Practice: Build Week",
    "Description": "This week we will use the skills we have learned to participate in a joint project with a development team made up of other Lambda students.",
    "Modules": "UX Build Week",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Design Core [v1 deprecated]",
    "Record ID": "recOihlpwJ6MAaCan",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/28/2018 4:10pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Advanced Discovery",
    "Description": "Discovery can be as simple as a single stakeholder meeting, but companies that prioritize design have discovered that putting ample time and resources into the discovery process is an investment that pays out over time. In-depth discovery programs can take weeks or even months for a large-scale redesign. Typically, for most product features, you can conduct sufficient research in just a few days or weeks. This week, we will discuss making a research plan along with some more advanced research methods you can use to conduct your discovery work.",
    "Modules": "Contextual Inquiry and Task Analysis",
    "Search Test": "",
    "Sprint Challenge": "Advanced Discovery Assessment",
    "Curriculum Sets": "UX Design Core [v1 deprecated]",
    "Record ID": "rec76KcKGTmz0eZuh",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/28/2018 4:10pm",
    "Objectives Count": 3,
    "Sprint Order": ""
  },
  {
    "Name": "Advanced Experience Definition",
    "Description": "In this sprint, we'll continue learning advanced concepts and methodologies used in the UX process. We'll learn how to create project and design briefs to align our teams better. Then, we'll cover the basics of Agile design and user stories before continuing our explorations of Jobs to be Done Theory. Finally, we'll revisit Customer Journey Maps and learn more universal design principles.",
    "Modules": "Designing for the Human Mind II,Customer Journey Maps,Jobs to be Done Theory & Job Stories,Writing Project and Design Briefs",
    "Search Test": "",
    "Sprint Challenge": "Advanced Experience Definition Assessment",
    "Curriculum Sets": "UX Design Core [v1 deprecated]",
    "Record ID": "recX493HQq8GMk7OL",
    "Module Count": 4,
    "Average Projected Level": 3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/28/2018 4:13pm",
    "Objectives Count": 7,
    "Sprint Order": ""
  },
  {
    "Name": "Advanced Ideation and UX Leadership",
    "Description": "We'll tackle Design Thinking, storytelling, pair design and high-fidelity design in this sprint.",
    "Modules": "High-Fidelity Design Practice,Transitioning from Wireframes to High-Fidelity Design,Pair Design,Design Thinking and Beyond",
    "Search Test": "",
    "Sprint Challenge": "Advanced Ideation and UX Leadership Sprint Challenge",
    "Curriculum Sets": "UX Design Core [v1 deprecated]",
    "Record ID": "recNwj3QEByQAwBB3",
    "Module Count": 4,
    "Average Projected Level": 1.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/28/2018 4:13pm",
    "Objectives Count": 7,
    "Sprint Order": ""
  },
  {
    "Name": "Advanced Design: Design Systems and UX In Practice",
    "Description": "In this sprint, we'll continue learning advanced concepts and methodologies used in the UX process. We'll learn how to create design systems to bring consistency to our work. Then, we'll explore the various guidelines established about designing for mobile. Finally, we'll wrap up by focusing on UX project management and what it's like to work as a UX designer.",
    "Modules": "Working as a UX Designer,UX Project Management,\"iOS Human Interface Guidelines, Material Design, and Android Considerations\",Introduction to Creating and Using Design Systems",
    "Search Test": "",
    "Sprint Challenge": "Advanced Design Assessment",
    "Curriculum Sets": "UX Design Core [v1 deprecated]",
    "Record ID": "recxRwsvyAk923SkG",
    "Module Count": 4,
    "Average Projected Level": 2.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/28/2018 4:14pm",
    "Objectives Count": 10,
    "Sprint Order": ""
  },
  {
    "Name": "Design in Practice: Google Sprint",
    "Description": "The Google design sprint was conceived by Jake Knapp. He wrote a book about the process. The process uses some of the same design and ideation techniques we have discussed previously. In the book, Mr. Knapp gives a systematized process for solving big design challenges that covers five days of working together to go from problem to potential testable solution.\n\nFor this Lambda sprint we will conduct a Google Sprint using the 2.0 adaptations promulgated by AJ&Smart (a digital design consultancy) in 2018.",
    "Modules": "Google Sprint 2.0 — Thursday: Test,Google Sprint 2.0 — Wednesday: Prototype,Google Sprint 2.0 — Tuesday: Decide and Story-board,Google Sprint 2.0 — Monday: Map and Sketch",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Design Core [v1 deprecated],UX Design Core",
    "Record ID": "rechMnzQo1g6gr29v",
    "Module Count": 4,
    "Average Projected Level": 1.8,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/28/2018 4:34pm",
    "Objectives Count": 13,
    "Sprint Order": ""
  },
  {
    "Name": "Design in Practice: Group Project 1 week 1",
    "Description": "For the next two weeks, you will be working on a project for real entrepreneurs. They will be sharing an idea for a project that you will then develop using the product design cycle. In this Sprint, you will be focusing on your Discovery, Definition, and Ideation efforts.",
    "Modules": "Ideation in Practice,Define the Product,Discovery",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Design Core [v1 deprecated],UX Design Core",
    "Record ID": "recGzKZTW3Y8AA9UZ",
    "Module Count": 3,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/28/2018 4:37pm",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "Design in Practice: Group Project 1 week 2",
    "Description": "For the next two weeks, you will be working on a project for real entrepreneurs. They will be sharing an idea for a project that you will then develop using the product design cycle. In this Sprint, you will be focusing on Prototyping, Design, Testing, and Presenting.",
    "Modules": "Client Presentation,High Fidelity MVP,Prototyping and Testing",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Design Core [v1 deprecated],UX Design Core",
    "Record ID": "recjIntdnw9uWgTCJ",
    "Module Count": 3,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/28/2018 4:37pm",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "Design in Practice: Solo Project Week",
    "Description": "This week, you will be working on a project for a real entrepreneur. The entrepreneur will be sharing an idea for a project that you will then design using the product design cycle. Our primary focus will be having a high-fidelity minimum viable product version of an app prototype. We will condense the discovery and definition phases to move quickly into ideation.",
    "Modules": "High-Fidelity UI Design in Practice,User Testing in Practice,Prototyping in Practice,Ideation in Practice",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Design Core [v1 deprecated],UX Design Core",
    "Record ID": "recRT0W3jqNKZK0vR",
    "Module Count": 4,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/28/2018 4:41pm",
    "Objectives Count": 4,
    "Sprint Order": ""
  },
  {
    "Name": "Fundamentals: Ideation and Creativity",
    "Description": "",
    "Modules": "Presenting Ideas; The Art of the Critique, to Give and Receive\",\"Getting Out of Your Head, Getting Out of the Office, Personal Productivity\",Rapid Sketching; Sketching Interfaces; Paper Prototypes,Group Creativity and Leading UX Workshops",
    "Search Test": "",
    "Sprint Challenge": "Ideation and Creativity Assessment",
    "Curriculum Sets": "UX Design Core [v1 deprecated]",
    "Record ID": "rect2lXo4sTxdkuLQ",
    "Module Count": 4,
    "Average Projected Level": 0.8,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "9/28/2018 4:54pm",
    "Objectives Count": 10,
    "Sprint Order": ""
  },
  {
    "Name": "Professionalism/Communication",
    "Description": "",
    "Modules": "Four Ways to Respond,Community Outreach/Outcomes Team Info",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Principles for Success",
    "Record ID": "recbEQp4lLrTlEfl4",
    "Module Count": 2,
    "Average Projected Level": 0.5,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "10/12/2018 11:30am",
    "Objectives Count": 3,
    "Sprint Order": ""
  },
  {
    "Name": "Empathy/Diversity",
    "Description": "",
    "Modules": "Blueprints of Me: Part 1",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Principles for Success",
    "Record ID": "rec4w3N3GJlQpcVqu",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "10/12/2018 11:30am",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Tips and Tricks on How to Advance your Life and Career",
    "Description": "",
    "Modules": "Info Session - Principles for Success,Imposter Syndrome Presentation #1",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Principles for Success",
    "Record ID": "recbcxau3VQZpMLtQ",
    "Module Count": 2,
    "Average Projected Level": 0.5,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "10/12/2018 11:30am",
    "Objectives Count": 4,
    "Sprint Order": ""
  },
  {
    "Name": "Labs VII",
    "Description": "Note:  This sprint only applies to students who start Labs _before_ CS.\n\nIn this sprint, students will complete a capstone defense and prepare their product for launch.",
    "Modules": "Labs Capstone",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recEuwKjl4wOo4YHs",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "10/24/2018 5:54pm",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "Project Week: Cellular Automata",
    "Description": "In this project week, you'll be creating a simulation that visualizes the well known cellular automata, _Conway's Game of Life_.",
    "Modules": "Game of Life",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Computer Science Annex",
    "Record ID": "recTTpwFpgZXtPG2o",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "10/25/2018 2:10pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Android Unit 1 Project Week: Android Fundamentals",
    "Description": "The project this week will give you a chance to practice and apply the concepts you've learned the past four weeks. You'll build a complete, full-featured Android app that does networking and uses SQLite for persistence.",
    "Modules": "Android Fundamentals Project Week Kickoff",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recJty0LVDoZfGsvW",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "12/6/2018 6:19pm",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Brownbags",
    "Description": "",
    "Modules": "Brownbag Presentations,Company Presentations",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Brownbag Presentations",
    "Record ID": "recgiQDKNaODHOBdH",
    "Module Count": 2,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "12/12/2018 10:48am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Precourse UX",
    "Record ID": "recbcbqaOxzzHLJz4",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "12/12/2018 2:21pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Data Structures",
    "Description": "In this sprint, students will be familiarizing themselves with fundamental data structures, specifically linked lists, queues, binary search trees, and heaps. \n\nJust as importantly, students will also learn how to analyze the complexity of algorithms that make up the methods associated with each data structure. These include inserting, deleting, searching for, and sorting elements. Students will practice classifying algorithms using Big O notation, and learn how to compare different algorithms against each other using these runtime classifications.",
    "Modules": "Data Structures",
    "Search Test": "",
    "Sprint Challenge": "Data Structures",
    "Curriculum Sets": "Computer Science,DS - Computer Science",
    "Record ID": "recR4gHcvD21ziR9a",
    "Module Count": 1,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "Jonathan Bennett,Adam Hobson,Vijay Swamidass",
    "Advisory Council Reviews 2": "",
    "Created time": "12/21/2018 3:39pm",
    "Objectives Count": 4,
    "Sprint Order": 2
  },
  {
    "Name": "UX Fundamentals",
    "Description": "Welcome to the UX course at Lambda School! We'll start with an introduction to the world of UX plus a look at what it takes to be successful at Lambda School and in your career.",
    "Modules": "Developing a UX Mentality,Common UX Misconceptions,Starting Your UX Career,Intro to UX",
    "Search Test": "",
    "Sprint Challenge": "UX Fundamentals Sprint Challenge",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "recdiFDBPeSje4tzL",
    "Module Count": 4,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/2/2019 10:08am",
    "Objectives Count": 12,
    "Sprint Order": ""
  },
  {
    "Name": "Intro to Design Theory",
    "Description": "To be designers, we need a solid foundation in design theory. We'll take a look at the essential components of design and learn how to leverage them to produce visually appealing work.",
    "Modules": "Intro to Drawing,Designing for the Human Mind,Intro to Visual Hierarchy,Intro to Typography & Color Theory",
    "Search Test": "",
    "Sprint Challenge": "Intro to Design Theory Sprint Challenge",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "recBuxg8uzDK5vFG4",
    "Module Count": 4,
    "Average Projected Level": 1.5,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/2/2019 10:10am",
    "Objectives Count": 13,
    "Sprint Order": ""
  },
  {
    "Name": "UI Fundamentals",
    "Description": "There are many disciplines within the field of design. As UX designers, we'll need to learn how to design for the unique concerns of user interfaces with tools like Sketch and InVision.",
    "Modules": "Responsive Design,Designing User Interfaces,Intro to InVision & Craft,Intro to Sketch",
    "Search Test": "",
    "Sprint Challenge": "UI Fundamentals Sprint Challenge",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "recMiazRfkTJYcLN5",
    "Module Count": 4,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/2/2019 10:12am",
    "Objectives Count": 14,
    "Sprint Order": ""
  },
  {
    "Name": "UX Processes",
    "Description": "Understanding when to use the right tool for a job is a critical skill to master. We'll take an in-depth look at various UX processes and learn when and how we'd use them to build products.",
    "Modules": "Project and Design Briefs,UX Project Management,Intro to Lean UX,Intro to the Product Design Cycle",
    "Search Test": "",
    "Sprint Challenge": "UX Processes Sprint Challenge",
    "Curriculum Sets": "",
    "Record ID": "rect9dew7DRmJJYzv",
    "Module Count": 4,
    "Average Projected Level": 2.5,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/2/2019 10:13am",
    "Objectives Count": 9,
    "Sprint Order": ""
  },
  {
    "Name": "UX Unit 1 Project Week: UI Practice",
    "Description": "The main object of this week is to practice design theory, user interface design, and UX processes using all of the skills and concepts you have learned here at Lambda School so far.",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "Unit 1 - Project Week",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "recDhkxAxMHglFnBa",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/2/2019 10:20am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Data Wrangling and Storytelling",
    "Description": "Loading data is a fundamental, and deceptively challenging, step. Getting it in the right “shape” and format for analysis and modeling is always a challenge. This week we’ll practice these skills, and learn to appreciate the many tools Python gives us for these tasks.",
    "Modules": "Sequence your narrative,Make explanatory visualizations,Begin your portfolio,Join and Reshape Data",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Statistics Fundamentals",
    "Record ID": "rec2a82u6kWqXEB45",
    "Module Count": 4,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/9/2019 3:25pm",
    "Objectives Count": 12,
    "Sprint Order": ""
  },
  {
    "Name": "Career Services Expectations/Tech Landscape",
    "Description": "On the Career Services team we provide a variety of services to aid in your job search. Throughout Lambda School you will learn the technical skills necessary to become a professional in your field, however the skills needed to land a job is what the Career Services team is all about.",
    "Modules": "Intro to Careers and the Tech Landscape",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recXOpK6geXY9pa1u",
    "Module Count": 1,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/15/2019 12:55pm",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "Building a Portfolio Website",
    "Description": "",
    "Modules": "Building a Portfolio Website",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "rec9h6gFJ3nh0yzve",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/30/2019 11:23am",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Resume",
    "Description": "",
    "Modules": "Resume",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recY8JniPAYiyBkdA",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/17/2019 3:37pm",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "LinkedIn",
    "Description": "",
    "Modules": "LinkedIn",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recJNA9yKq5wtDqSG",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/17/2019 5:49pm",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Artifacts",
    "Description": "",
    "Modules": "Artifacts",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "reczbkdSRbXnliIds",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/18/2019 12:10pm",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Java Fundamentals",
    "Description": "",
    "Modules": "Java IV - IntelliJ Deep Dive, Dependencies\",\"Java III - Interfaces, Abstract Classes, Lambda Expression\",Java II - Language Fundamentals,Java I - JDK and Java Classes",
    "Search Test": "",
    "Sprint Challenge": "Sprint Challenge Java Fundamentals Piggybank",
    "Curriculum Sets": "Java Backend Development",
    "Record ID": "recoJ4ZqNQWX3cy6E",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/18/2019 12:11pm",
    "Objectives Count": 12,
    "Sprint Order": ""
  },
  {
    "Name": "Building Java Web APIs",
    "Description": "",
    "Modules": "Deployment and Best Practices with Spring Cloud Config Server,\"Middleware, Logging, Message Queues\",\"Exception Handling, Java Front End\",\"Intro to Maven, Spring, and Tomcat using REST Api",
    "Search Test": "",
    "Sprint Challenge": "Sprint-Challenge Building Java Web APIs gdp",
    "Curriculum Sets": "Java Backend Development,Android Development Core",
    "Record ID": "recsulbZ7qtwEknSU",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/30/2019 11:13am",
    "Objectives Count": 14,
    "Sprint Order": ""
  },
  {
    "Name": "Java Backend Data Persistence with SQL, Hibernate",
    "Description": "",
    "Modules": "Java RDBMS IV Data Modeling and Authentication,Java RDBMS III Querying and Seeding,Java RDBMS II Inserting and Modifying Data using CRUD Operations,Java RDBMS I RDBMS and SQL Basics",
    "Search Test": "",
    "Sprint Challenge": "Sprint Challenge Java Backend Data Persistence with SQL Hibernate java todos",
    "Curriculum Sets": "Java Backend Development,Android Development Core",
    "Record ID": "recRVUSWQEtosl0Cz",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/30/2019 11:13am",
    "Objectives Count": 16,
    "Sprint Order": ""
  },
  {
    "Name": "Java Testing and Continuous Integration",
    "Description": "",
    "Modules": "Intro to Agile and JIRA,Continuous Integration with Jenkins,Paging and Sorting with Detailed Swagger Documentation,Automated Testing using TDD",
    "Search Test": "",
    "Sprint Challenge": "Sprint Challenge Java Testing and Continuous Integration java bookstore",
    "Curriculum Sets": "Java Backend Development,Android Development Core",
    "Record ID": "recSqm5AAEkJcIl3p",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/30/2019 11:13am",
    "Objectives Count": 12,
    "Sprint Order": ""
  },
  {
    "Name": "Java Project Week",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Java Backend Development,Android Development Core",
    "Record ID": "recC5dhR9menaROwx",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/30/2019 11:13am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Android Unit 2 Project Week: Architecture and Design",
    "Description": "The project this week will give you a chance to practice and apply the concepts you've learned the past four weeks. You'll build an Android app.",
    "Modules": "Intermediate Android Development Project Week Kickoff",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Android Development Core",
    "Record ID": "rec1ThpG6q8Gv9FtE",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "1/30/2019 6:42pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Tell Your Story: How to Create an Effective Elevator Pitch",
    "Description": "",
    "Modules": "Tell Your Story: How to Create an Effective Elevator Pitch",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recYGRnwPPZuNUXZq",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/2/2019 10:09am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recsxNSrKvqb3A5tD",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/6/2019 10:35am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Discovery",
    "Description": "",
    "Modules": "Additional Research Methods,Making a Research Plan,User Interviews,Stakeholder Interviews & User Recruiting",
    "Search Test": "",
    "Sprint Challenge": "Discovery Sprint Challenge",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "rec3UNewTTB20mV6v",
    "Module Count": 4,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/6/2019 10:37am",
    "Objectives Count": 14,
    "Sprint Order": ""
  },
  {
    "Name": "Definition",
    "Description": "",
    "Modules": "Documenting and Diagramming a User Flow,Intro to Information Architecture (IA),Customer Journey Maps,Creating and Using Personas",
    "Search Test": "",
    "Sprint Challenge": "UX Definition Assessment",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "recNrHFznMIbs01ZE",
    "Module Count": 4,
    "Average Projected Level": 1.5,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/6/2019 10:37am",
    "Objectives Count": 15,
    "Sprint Order": ""
  },
  {
    "Name": "Ideation and Collaboration",
    "Description": "",
    "Modules": "Design Thinking and Beyond,Wireframes and Click-through Prototyping,Lo-Fi Ideation/Rapid Iteration,Group Creativity and Leading UX Workshops",
    "Search Test": "",
    "Sprint Challenge": "Ideation and Collaboration Sprint Challenge",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "rec9GvqRZGoelFcGT",
    "Module Count": 4,
    "Average Projected Level": 1.8,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/6/2019 10:37am",
    "Objectives Count": 10,
    "Sprint Order": ""
  },
  {
    "Name": "Prototyping",
    "Description": "",
    "Modules": "Design Handoffs and Dev Collaboration,Usability Testing,Transitioning from Wireframes to High-Fidelity Design,Introduction to Creating and Using Design Systems",
    "Search Test": "",
    "Sprint Challenge": "Finalize your Presentation and Case Study Sprint Challenge",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "recEOVZLSshEliC3O",
    "Module Count": 4,
    "Average Projected Level": 2.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/6/2019 10:37am",
    "Objectives Count": 9,
    "Sprint Order": ""
  },
  {
    "Name": "UX Unit 2 Build Week: UX Collaboration",
    "Description": "#### UX Designer Role Description\n\nThroughout the course, you have learned the Product Design Cycle and how to create UX deliverables that support a development team’s efforts. Now you will guide the design and user experience of your team’s MVP while practicing how to collaborate with developers.\n\n#### Your Primary Role\n\nYou will be supporting your team’s development efforts by ensuring that your MVP is a usable product. Your primary focus will be on articulating the overall user experience through user flows and wireframes before verifying its usability via user tests and heuristic reviews. Your secondary focus will be on designing a style guide and ensuring that your team uses a consistent visual style in your MVP.\n\nThe visual design of your MVP will be starting from a design system of your choice. (Collaborate with your team to ensure the design system is a viable choice for the development team.) The design system is to jumpstart your team’s design choices and product structure. They are only a starting point and you can tweak them if they do not support the vision or functionality of your MVP. However, you are free to use them and focus on other efforts if they work for your team. Keep in mind the timeframe of this project and consider all that needs to be accomplished before trying to make major modifications to the system.\n\nRemember that you are not the manager, boss, or design visionary of this MVP. You are a member of this team who shares an equal rank with your teammates. Your job is to work collaboratively with your team to deliver the best user experience possible. Good ideas can come from anywhere, so be sure to collaborate early and often.\n\n#### Grading Rubric Link:\n\nUse [this rubric]\n(https://docs.google.com/spreadsheets/d/1hT2-bLRXVr3sF2fUJZRr0xAL1JjV3FV2iVr_OTtXMSo/edit?usp=sharing) to help guide your efforts.",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "rechmG7z5ikRqoWOH",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/6/2019 10:38am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Cross-Functional Collaboration",
    "Description": "",
    "Modules": "How Does it Work in IRL?,Design Handoff,Design Sprints,Labs Debrief",
    "Search Test": "",
    "Sprint Challenge": "Cross-Functional Collaboration Sprint Challenge",
    "Curriculum Sets": "",
    "Record ID": "rec0QRInj2ikKf3eL",
    "Module Count": 4,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/6/2019 10:39am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Quantitative User Research",
    "Description": "",
    "Modules": "Steve Krug,Surveys,\"Analytics, HotJar, etc",
    "Search Test": "",
    "Sprint Challenge": "Quantitative User Research Sprint Challenge",
    "Curriculum Sets": "",
    "Record ID": "recqCczuYV4Kqfbpo",
    "Module Count": 3,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/6/2019 10:39am",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Designing for the Human Mind",
    "Description": "",
    "Modules": "Gamification,Psychology of Persuasion,Conducting a Heuristic Analysis,Usability Heuristics",
    "Search Test": "",
    "Sprint Challenge": "Designing for the Human Mind Sprint Challenge",
    "Curriculum Sets": "",
    "Record ID": "recA0HobesiSiQiOt",
    "Module Count": 4,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/6/2019 10:39am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Product and Business Considerations",
    "Description": "",
    "Modules": "Accounting, Marketing, Financial Modeling, ROI\",Lean/Product Validation,Product Planning,Business Strategy",
    "Search Test": "",
    "Sprint Challenge": "Product and Business Considerations Sprint Challenge",
    "Curriculum Sets": "",
    "Record ID": "recU2xcpW3v9J6Kds",
    "Module Count": 4,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/6/2019 10:39am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "UX Unit 3 Project Week: Research Week",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "recYrM5Q6LgpnN0Mm",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/6/2019 10:39am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Bait the Hook to Suit the Fish",
    "Description": "",
    "Modules": "Bait the Hook to Suit the Fish",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recXTDzgCzO8PEmOs",
    "Module Count": 1,
    "Average Projected Level": 3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "2/18/2019 4:39pm",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "How to Use Social Media in Tech",
    "Description": "",
    "Modules": "How to Use Social Media in Tech",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recqTcLOLdc719Ie7",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "3/4/2019 11:51am",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Cold Outreach and In-person Networking",
    "Description": "",
    "Modules": "Cold Outreach",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recpYX32YK6PTHCv2",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "3/4/2019 4:49pm",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "Sourcing Opportunities",
    "Description": "",
    "Modules": "Sourcing Opportunities",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "reckNBVBk8Dr3ManC",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "3/4/2019 4:57pm",
    "Objectives Count": 3,
    "Sprint Order": ""
  },
  {
    "Name": "Neural Network Foundations",
    "Description": "Neural Networks - the latest and greatest in predictive modeling. Or is it? Inspired by biology and based on math that’s been around for decades, the past few years have seen some pretty impressive results as computational resources allow running much larger networks. We can now identify cat pictures! And much more...",
    "Modules": "Hyperparameter Tuning and Model Evaluation,Introduction to Keras,Backpropagation,Intro to Neural Networks",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Machine Learning",
    "Record ID": "recUR5N8Vo1lO7gvr",
    "Module Count": 4,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "3/8/2019 1:37pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Intro to Careers and the Tech Landscape",
    "Description": "**Welcome to Lambda School! Hopefully your first week was challenging, rewarding, and has you excited for all that is to come over the next several months that you’re learning with Lambda School! While you all joined Lambda School to build your tech skills, you’re also here to make a career change. Learning new skills for the sake of skills is great, but the majority of Lambda Students come to us to make a significant shift.\n\nSome of you may be wondering, “Why are we starting careers in week 2?? I’m not going to be job searching for months!” We’ll answer this question, and get you ready to dive into your searches (yes, now!) in today’s kick-off lesson.**",
    "Modules": "Intro to Careers and the Tech Landscape",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Development",
    "Record ID": "recFsbIJCXzTlWydm",
    "Module Count": 1,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "3/12/2019 2:16pm",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "In-Person Networking",
    "Description": "",
    "Modules": "In-Person Networking",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recdMu1kj9lKKMzBi",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "3/12/2019 4:21pm",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Intermediate UI",
    "Description": "We'll continue to practice our UI design skills and learn more about the different interface paradigms we'll encounter.",
    "Modules": "Design Communication,UI Patterns II,UI Patterns I,Interaction Design",
    "Search Test": "",
    "Sprint Challenge": "Intermediate UI Sprint Challenge",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "recVuPjr3iGoCO6Xy",
    "Module Count": 4,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "3/26/2019 9:11am",
    "Objectives Count": 14,
    "Sprint Order": ""
  },
  {
    "Name": "Job Search Strategy",
    "Description": "",
    "Modules": "Job Search Strategy",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "rec1p8hmgFTk6g9fz",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "3/27/2019 11:51am",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "Interview/Star Stories",
    "Description": "",
    "Modules": "Interviewing and STAR Stories",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recl2d0YfOGAlM8S3",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "3/27/2019 11:51am",
    "Objectives Count": 5,
    "Sprint Order": ""
  },
  {
    "Name": "Interview Etiquette/Strategies",
    "Description": "While how you prepare for an interview may vary greatly by field and company, there are some strategies that will help you make a strong impression regardless of where you're interviewing, or what point you're at in your career. Similarly, missing out on key opportunities to make an impression could send a message you don't want to send about you as a candidate, so knowing how to navigate the nuances of interviewing etiquette is key to securing your next opportunity!",
    "Modules": "Interviewing Etiquette",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recX5xseDC08JM5ZI",
    "Module Count": 1,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "3/27/2019 11:51am",
    "Objectives Count": 4,
    "Sprint Order": ""
  },
  {
    "Name": "Financial Planning, Offers, and Negotiations",
    "Description": "",
    "Modules": "Financial Planning, Offers, and Negotiations",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recasYYZGAH1sAnPX",
    "Module Count": 1,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/9/2019 6:01pm",
    "Objectives Count": 3,
    "Sprint Order": ""
  },
  {
    "Name": "",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recpePgN6yJGQVhcB",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/12/2019 10:01am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Java Back End Introduction and Software Installations",
    "Description": "# Welcome to the Java Back End course! \n\nThe Lambda School Java Back End Course concentrates on learning Object Oriented Programming, the strongly typed language Java and how Java interacts with databases using Spring Boot and REST API Services. The JetBrains ItelliJ IDEA IDE and Maven are used to integrate services with a RDBMS using JPA and Hibernate while deploying those web services using Tomcat. Jenkins is used for Continuous Integration, Jira is used for Agile Project Management, and Swagger is used for REST documentation. Using Java 11, students study both current best practices and legacy code with the goal of being comfortable working with Java 8+. The students also receive some exposure to message queueing using RabbitMQ, in-memory caching with Redis, and Spring Cloud Config Server. Overall the course is preparing students to be ready to integrate into current Java Spring Teams!\n\nThe work is hard but very rewarding and enjoyable! I hope you decide to join the class. If you have already joined, Welcome!!! If you decide not join, enjoy your other courses and feel free to reach out with future Java Questions!\n\n## Software Installations\n\nSeveral different software packages will be used throughout this course. You will need them installed on your machine. Below is a schedule saying by when you need the software installed. \n\nWeek 1 Monday\n* Homebrew (Mac only)\n* JDK 11\n* Sublime Text Editor (or your favorite text editor)\n* Git\n\nWeek 1 Thursday\n* Jet Brains IntelliJ IDEA Ultimate Edition including configuration\n\nWeek 2 Monday\n* Postman\n\nWeek 2 Wednesday\n* RabbitMQ\n\nWeek 2 Thursday\n* Heroku CLI\n* Apache Tomcat\n\nWeek 3 Monday\n* PostgreSQL\n\nWeek 4 Tuesday\n* Redis\n\nThe links below give you instructions on how to install the software on various operating systems.",
    "Modules": "Software Installations for Linux (Ubuntu 18),Software Installations for Mac,Software Installations for Windows 10,Java Back End Course Introduction",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Java Backend Development",
    "Record ID": "recuZlDDpcoAdG6vO",
    "Module Count": 4,
    "Average Projected Level": 0.8,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/12/2019 3:14pm",
    "Objectives Count": 31,
    "Sprint Order": ""
  },
  {
    "Name": "Sharing Your Story and Networking Fundamentals",
    "Description": "Knowing how to tell your story is an important part of starting to build your professional network in your field. In this sprint, we'll review how you can use your story to start building and maintain your network.",
    "Modules": "Sharing Your Story and Networking Fundamentals",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recevxobvOSSg3nzd",
    "Module Count": 1,
    "Average Projected Level": 4,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/25/2019 1:36pm",
    "Objectives Count": 3,
    "Sprint Order": ""
  },
  {
    "Name": "Practicing & Understanding Predictive Modeling",
    "Description": "",
    "Modules": "Gradient Descent,Model interpretation,Regularization & Survival Analysis,Hyperparameter optimization & Categorical encoding",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "recr8aHENDlJV359h",
    "Module Count": 4,
    "Average Projected Level": 1.5,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "4/26/2019 6:19pm",
    "Objectives Count": 6,
    "Sprint Order": ""
  },
  {
    "Name": "Imposter Syndrome and Diversity and Inclusion",
    "Description": "**Imposter syndrome and diversity and inclusion are two distinct topics, but we’re talking about them together today because we often see them feeding into/off of one another. It’s a lot easier to feel like an “imposter”, like you don’t belong, if you look around at the different faces in your company and see very few, or no, people who look like you or share your background. And while you may think, “it’s ok, I’m at work to do a job, not to make friends or be my totally relaxed self,” there is a lot of evidence to back up that when employees feel confident sharing ideas, feedback, and questions, they are not only happier at work, but more productive. A lack of inclusivity can lead to staff feeling increased senses of imposter syndrome, and a decreased likelihood to ask questions or share ideas.**",
    "Modules": "Imposter Syndrome and Diversity and Inclusion",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recqZAtNtjTC5GAJh",
    "Module Count": 1,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/6/2019 4:41pm",
    "Objectives Count": 3,
    "Sprint Order": ""
  },
  {
    "Name": "Navigating Offers and Negotiations",
    "Description": "**We cover this topic earlier than most of you will actually need to practice negotiating offers or salaries because often by the time you are facing and offer or opportunity to negotiate, you may not have a lot of time and flexibility to prepare or run through a practice conversation with somebody. Know what to expect and best practices for navigating offers and negotiations so that when the time comes, you're prepared to handle them professionally and in a way that benefits you!**",
    "Modules": "Navigating Offers and Negotiations",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "rec0uIMgOv1kxZncp",
    "Module Count": 1,
    "Average Projected Level": 2,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/6/2019 6:26pm",
    "Objectives Count": 4,
    "Sprint Order": ""
  },
  {
    "Name": "Web for UX: Intro to HTML and CSS",
    "Description": "User experience designers who understand some of the fundamentals of front-end technologies can converse better with developers, know better the limitations of the medium they are designing for, and can use the technology to prototype concepts.\n\nWe introduce the basic languages of web interface design in this unit.",
    "Modules": "User Interface III,User Interface II,User Interface I,Forms",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Web and Labs Prep Unit",
    "Record ID": "recTK97DRZq5kv1bZ",
    "Module Count": 4,
    "Average Projected Level": 2.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/9/2019 12:13pm",
    "Objectives Count": 9,
    "Sprint Order": ""
  },
  {
    "Name": "Web for UX: Box Model and CSS",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "reclImxR37168IsLI",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/9/2019 12:13pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Web for UX: Flex Box",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "rec0tvjlwK4XBQSgR",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/9/2019 12:15pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Web for UX: Forms",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "",
    "Record ID": "rec1NrCwctnTAGUy2",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/9/2019 12:15pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Web for UX: Prototyping in Code",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Web and Labs Prep Unit",
    "Record ID": "recGpyFrR6PPmHBY7",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/9/2019 12:18pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "UI Design: Evaluation and Practice",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Web and Labs Prep Unit",
    "Record ID": "recXp8tCQi7tVzuJL",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/9/2019 12:20pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "UX Labs: Discovery and Definition",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Web and Labs Prep Unit",
    "Record ID": "recDFCRUNVxt4ZCq7",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/9/2019 12:20pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "UX Labs: Definition and Ideation",
    "Description": "",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Web and Labs Prep Unit",
    "Record ID": "recSj7D1MnfSc54rM",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/9/2019 12:21pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Sharing Your Story, with Confidence!",
    "Description": "",
    "Modules": "Sharing Your Story, with Confidence!",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recPBTs84COplDYm6",
    "Module Count": 1,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/15/2019 1:48pm",
    "Objectives Count": 1,
    "Sprint Order": ""
  },
  {
    "Name": "Team Dynamics and Feedback",
    "Description": "You will do a lot of teamwork here at Lambda School. This isn’t just for the sake of it; working in teams is absolutely critical to nearly any field, but especially web/mobile development, data science, and design, where you frequently are working to execute broader company goals/meet other teams’ needs. Even freelancers who don’t work on a team still need to be able to effectively work with a client, so it’s just as critical for your long-term success to be able to work with others well as it is to have the technical skills to do the job.",
    "Modules": "Team Dynamics and Feedback",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recqMOcFStSZAveit",
    "Module Count": 1,
    "Average Projected Level": 3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/17/2019 8:37pm",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "Introduction to iOS Programming",
    "Description": "Welcome to iOS Development! This Sprint introduces fundamental technologies and concepts used to create basic iOS apps. \n\nYou start by learning about Xcode, the tool you'll be using to build applications on a daily basis. Xcode provides an integrated design environment (IDE) that transforms screen designs and code into working iOS applications. You'll use Xcode to build a simple app to get used to the meta-tasks of app creation (the things other than the code itself).\n\nThen you'll dive into two days of Swift fundamentals. Here you'll learn about data structures, control flow, looping, optionals, mutability, and other topics that are fundamental to writing well formed and clean Swift code.",
    "Modules": "Swift Fundamentals II,Swift Fundamentals I,Xcode and Interface Builder Tour,First iOS App: Navigation Controller",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "iOS Development Core",
    "Record ID": "recoCrIOkHUmrt6HN",
    "Module Count": 4,
    "Average Projected Level": 1.8,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/20/2019 10:11am",
    "Objectives Count": 16,
    "Sprint Order": ""
  },
  {
    "Name": "Intro to HTML & CSS",
    "Description": "HTML and CSS are the building blocks of web user interfaces. We'll learn how to use these technologies so we can understand how user interfaces are created.",
    "Modules": "Forms,CSS,HTML",
    "Search Test": "",
    "Sprint Challenge": "Intro to HTML & CSS Challenge",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "recqidLwS7wDOQTv8",
    "Module Count": 3,
    "Average Projected Level": 1.7,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/20/2019 11:53am",
    "Objectives Count": 14,
    "Sprint Order": ""
  },
  {
    "Name": "Weeks 2-4 Recap and Goal-Setting",
    "Description": "Over the past few weeks, we’ve talked about some introductory principles in job searching/understanding the tech field, navigating team dynamics, and knowing your worth/planning financially. Many of you are in your first Build Week right now, so this week is to revisit some of the main topics we’ve covered already without adding new concepts since we know Build Weeks are demanding.",
    "Modules": "Weeks 2-4 Recap and Goal-Setting",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Career Readiness",
    "Record ID": "recJesNNkUFSsjqnv",
    "Module Count": 1,
    "Average Projected Level": 3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/20/2019 11:55am",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "Responsive & Interactive Web Dev",
    "Description": "Responsive design pushes our basic CSS styling forward into thousands of devices. A growing trend in today’s markets continue to be mobile devices that range from large tablets to small screens. You need to be able to correctly deliver content to all of these mediums.\n\nOnce we've done that, we'll start adding some interactivity to our code with JavaScript!",
    "Modules": "Interactive DOM,UX JavaScript I,Responsive Web II,Responsive Web I",
    "Search Test": "",
    "Sprint Challenge": "Responsive & Interactive Web Challenge",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "rec7gSFPihvjQnmyG",
    "Module Count": 4,
    "Average Projected Level": 2.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/20/2019 11:56am",
    "Objectives Count": 14,
    "Sprint Order": ""
  },
  {
    "Name": "UI Evaluation & Practice",
    "Description": "As UX designers, we need to be well versed in de-constructing existing user interfaces and experiences so we can improve them.",
    "Modules": "UI Evaluation and Practice IV,UI Evaluation and Practice III,UI Evaluation and Practice II,UI Evaluation and Practice I",
    "Search Test": "",
    "Sprint Challenge": "UI Evaluation and Practice",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "rec6nHbMZ5bFFUPan",
    "Module Count": 4,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/20/2019 11:58am",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Labs Prep: Discovery and Definition",
    "Description": "You'll be conducting your Discovery and Definition activities for your Labs project.",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "reci4Y9BvNv6MgZJ4",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/20/2019 12:01pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Labs Prep: Definition and Ideation",
    "Description": "You'll be finishing your Definition activities and performing some Ideation for your Labs project.",
    "Modules": "",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "UX Design Core",
    "Record ID": "rectaQGJS7bmLfD0m",
    "Module Count": 0,
    "Average Projected Level": "NaN",
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/20/2019 12:07pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  },
  {
    "Name": "Problem Solving Background and Context",
    "Description": "The first step to formally learning how to problem solve is to develop and practice a system through which any problem can be applied. To that end, students will standardize around a problem solving framework enumerated by George Polya. The first two steps of the framework, understanding the problem at hand and devising a strategy for the problem, will be the main focus of the first unit of the Technical Mastery curriculum. Students will spend the majority of this unit, as well as the next one, applying and practicing these two steps.",
    "Modules": "Applying Polya's,Polya's Problem Solving Framework",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "Technical Mastery",
    "Record ID": "recbjtOOBaYfC1xUL",
    "Module Count": 2,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/23/2019 11:41am",
    "Objectives Count": 2,
    "Sprint Order": ""
  },
  {
    "Name": "State of the Art Machine Learning",
    "Description": "",
    "Modules": "Artificial General Intelligence and The Future,AutoML & Bayesian Optimization,ML on Edge,Genetic Evolution",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Machine Learning",
    "Record ID": "recBepxNchOvqinuV",
    "Module Count": 4,
    "Average Projected Level": 0.3,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/23/2019 1:05pm",
    "Objectives Count": 3,
    "Sprint Order": ""
  },
  {
    "Name": "Regression 1",
    "Description": "This sprint, you'll do two projects:\n\n1. Forecast pageviews, for a Wikipedia page you choose.\n\n2. Predict presidential election voting, with two features you choose.",
    "Modules": "Understanding Ordinary Least Squares,Doing Linear Regression,Evaluating Forecasts,Making Forecasts",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Predictive Modeling",
    "Record ID": "recMcnC3o0PBvVdiq",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/23/2019 11:05pm",
    "Objectives Count": 20,
    "Sprint Order": ""
  },
  {
    "Name": "Regression 2",
    "Description": "This sprint, your project is Caterpillar Tube Pricing: \n\nPredict the prices suppliers will quote for industrial tube assemblies.",
    "Modules": "Cross-Validation, Hyperparameter Optimization\",\"Permutation Importances, Partial Dependence Plots\",\"Gradient Boosting, More Feature Engineering\",\"Log-Linear Regression, Feature Engineering",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Predictive Modeling",
    "Record ID": "recxMsHuJqLZAGSZF",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/23/2019 11:05pm",
    "Objectives Count": 9,
    "Sprint Order": ""
  },
  {
    "Name": "Classification 1",
    "Description": "This sprint, your project is about water pumps in Tanzania.\n\nCan you predict which water pumps are faulty?",
    "Modules": "Confusion Matrix, Precision & Recall\",\"Random Forests, Ordinal Encoding\",\"Decision Trees, Data Cleaning\",\"Logistic Regression, One-Hot Encoding",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Predictive Modeling",
    "Record ID": "recrVERomzvHOPVmG",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/23/2019 11:05pm",
    "Objectives Count": 21,
    "Sprint Order": ""
  },
  {
    "Name": "Classification 2",
    "Description": "This sprint, your project is with Lending Club data, historical and current.\n\nPredict if peer-to-peer loans are charged off or fully paid. Decide which loans to invest in.",
    "Modules": "Gradient Descent,Making & explaining decisions,\"Class Imbalance, ROC AUC\",\"Making datasets, Avoiding leakage",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Predictive Modeling",
    "Record ID": "recquYUd6nXCvMIaU",
    "Module Count": 4,
    "Average Projected Level": 1,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/23/2019 11:05pm",
    "Objectives Count": 11,
    "Sprint Order": ""
  },
  {
    "Name": "DS Project 2 - Predictive Modeling portfolio project",
    "Description": "For your portfolio project, you will choose your own labeled, tabular dataset, train a predictive model, and publish a blog post or web app with visualizations to explain your model.",
    "Modules": "DS Project 2, Day 4\",\"DS Project 2, Day 3\",\"DS Project 2, Day 2\",\"DS Project 2, Day 1",
    "Search Test": "",
    "Sprint Challenge": "",
    "Curriculum Sets": "DS - Predictive Modeling",
    "Record ID": "reclu2nj43hQFPx2p",
    "Module Count": 4,
    "Average Projected Level": 0,
    "Advisory Council Reviews": "",
    "Advisory Council Reviews 2": "",
    "Created time": "5/23/2019 11:07pm",
    "Objectives Count": 0,
    "Sprint Order": ""
  }
]